vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
/*
 * Audio.cpp
 *
 *  Created on: Oct 26.2018
 *
 *  Version 2.0.7
 *  Updated on: Nov 22.2022
 *      Author: Wolle (schreibfaul1)
 *
 */
#include "Audio.h"
#include "aac_decoder/aac_decoder.h"
#include "flac_decoder/flac_decoder.h"
#include "mp3_decoder/mp3_decoder.h"

#ifdef SDFATFS_USED
fs::SDFATFS SD_SDFAT;
#endif

//---------------------------------------------------------------------------------------------------------------------
AudioBuffer::AudioBuffer(size_t maxBlockSize) {
  // if maxBlockSize isn't set use defaultspace (1600 bytes) is enough for aac
  // and mp3 player
  if (maxBlockSize)
    m_resBuffSizeRAM = maxBlockSize;
  if (maxBlockSize)
    m_maxBlockSize = maxBlockSize;
}

AudioBuffer::~AudioBuffer() {
  if (m_buffer)
    free(m_buffer);
  m_buffer = NULL;
}

void AudioBuffer::setBufsize(int ram, int psram) {
  if (ram > -1) // -1 == default / no change
    m_buffSizeRAM = ram;
  if (psram > -1)
    m_buffSizePSRAM = psram;
}

size_t AudioBuffer::init() {
  if (m_buffer)
    free(m_buffer);
  m_buffer = NULL;
  if (psramInit() && m_buffSizePSRAM > 0) {
    // PSRAM found, AudioBuffer will be allocated in PSRAM
    m_f_psram = true;
    m_buffSize = m_buffSizePSRAM;
    m_buffer = (uint8_t *)ps_calloc(m_buffSize, sizeof(uint8_t));
    m_buffSize = m_buffSizePSRAM - m_resBuffSizePSRAM;
  }
  if (m_buffer == NULL) {
    // PSRAM not found, not configured or not enough available
    m_f_psram = false;
    m_buffSize = m_buffSizeRAM;
    m_buffer = (uint8_t *)calloc(m_buffSize, sizeof(uint8_t));
    m_buffSize = m_buffSizeRAM - m_resBuffSizeRAM;
  }
  if (!m_buffer)
    return 0;
  m_f_init = true;
  resetBuffer();
  return m_buffSize;
}

void AudioBuffer::changeMaxBlockSize(uint16_t mbs) {
  m_maxBlockSize = mbs;
  return;
}

uint16_t AudioBuffer::getMaxBlockSize() { return m_maxBlockSize; }

size_t AudioBuffer::freeSpace() {
  if (m_readPtr >= m_writePtr) {
    m_freeSpace = (m_readPtr - m_writePtr);
  } else {
    m_freeSpace = (m_endPtr - m_writePtr) + (m_readPtr - m_buffer);
  }
  if (m_f_start)
    m_freeSpace = m_buffSize;
  return m_freeSpace - 1;
}

size_t AudioBuffer::writeSpace() {
  if (m_readPtr >= m_writePtr) {
    m_writeSpace =
        (m_readPtr - m_writePtr - 1); // readPtr must not be overtaken
  } else {
    if (getReadPos() == 0)
      m_writeSpace = (m_endPtr - m_writePtr - 1);
    else
      m_writeSpace = (m_endPtr - m_writePtr);
  }
  if (m_f_start)
    m_writeSpace = m_buffSize - 1;
  return m_writeSpace;
}

size_t AudioBuffer::bufferFilled() {
  if (m_writePtr >= m_readPtr) {
    m_dataLength = (m_writePtr - m_readPtr);
  } else {
    m_dataLength = (m_endPtr - m_readPtr) + (m_writePtr - m_buffer);
  }
  return m_dataLength;
}

void AudioBuffer::bytesWritten(size_t bw) {
  m_writePtr += bw;
  if (m_writePtr == m_endPtr) {
    m_writePtr = m_buffer;
  }
  if (bw && m_f_start)
    m_f_start = false;
}

void AudioBuffer::bytesWasRead(size_t br) {
  m_readPtr += br;
  if (m_readPtr >= m_endPtr) {
    size_t tmp = m_readPtr - m_endPtr;
    m_readPtr = m_buffer + tmp;
  }
}

uint8_t *AudioBuffer::getWritePtr() { return m_writePtr; }

uint8_t *AudioBuffer::getReadPtr() {
  size_t len = m_endPtr - m_readPtr;
  if (len < m_maxBlockSize) { // be sure the last frame is completed
    memcpy(m_endPtr, m_buffer,
           m_maxBlockSize - len); // cpy from m_buffer to m_endPtr with len
  }
  return m_readPtr;
}

void AudioBuffer::resetBuffer() {
  m_writePtr = m_buffer;
  m_readPtr = m_buffer;
  m_endPtr = m_buffer + m_buffSize;
  m_f_start = true;
  // memset(m_buffer, 0, m_buffSize); //Clear Inputbuffer
}

uint32_t AudioBuffer::getWritePos() { return m_writePtr - m_buffer; }

uint32_t AudioBuffer::getReadPos() { return m_readPtr - m_buffer; }
//---------------------------------------------------------------------------------------------------------------------
Audio::Audio(bool internalDAC /* = false */,
             uint8_t channelEnabled /* = I2S_DAC_CHANNEL_BOTH_EN */,
             uint8_t i2sPort) {

  //    build-in-DAC works only with ESP32 (ESP32-S3 has no build-in-DAC)
  //    build-in-DAC last working Arduino Version: 2.0.0-RC2
  //    possible values for channelEnabled are:
  //    I2S_DAC_CHANNEL_DISABLE  = 0,     Disable I2S built-in DAC signals
  //    I2S_DAC_CHANNEL_RIGHT_EN = 1,     Enable I2S built-in DAC right channel,
  //    maps to DAC channel 1 on GPIO25 I2S_DAC_CHANNEL_LEFT_EN  = 2,     Enable
  //    I2S built-in DAC left  channel, maps to DAC channel 2 on GPIO26
  //    I2S_DAC_CHANNEL_BOTH_EN  = 0x3,   Enable both of the I2S built-in DAC
  //    channels. I2S_DAC_CHANNEL_MAX      = 0x4,   I2S built-in DAC mode max
  //    index
#ifdef AUDIO_LOG
  m_f_Log = true;
#endif

  if (psramInit()) {
    m_chbufSize = 4096;
    m_chbuf = (char *)ps_malloc(m_chbufSize);
  } else {
    m_chbufSize = 512 + 64;
    m_chbuf = (char *)malloc(m_chbufSize);
  }

#ifndef AUDIO_NO_NETWORK
  clientsecure.setInsecure(); // if that can't be resolved update to ESP32
                              // Arduino version 1.0.5-rc05 or higher
#endif
  m_f_channelEnabled = channelEnabled;
  m_f_internalDAC = internalDAC;
  // i2s configuration
  m_i2s_num = i2sPort; // i2s port number
  m_i2s_config.sample_rate = 16000;
  m_i2s_config.bits_per_sample = I2S_BITS_PER_SAMPLE_16BIT;
  m_i2s_config.channel_format = I2S_CHANNEL_FMT_RIGHT_LEFT;
  m_i2s_config.intr_alloc_flags = ESP_INTR_FLAG_LEVEL1; // interrupt priority
  m_i2s_config.dma_buf_count = 16;
  m_i2s_config.dma_buf_len = 512;
  m_i2s_config.use_apll = APLL_DISABLE;   // must be disabled in V2.0.1-RC1
  m_i2s_config.tx_desc_auto_clear = true; // new in V1.0.1
  m_i2s_config.fixed_mclk = I2S_PIN_NO_CHANGE;

  if (internalDAC) {

#ifdef CONFIG_IDF_TARGET_ESP32 // ESP32S3 has no DAC

    log_i("internal DAC");
    m_i2s_config.mode =
        (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX | I2S_MODE_DAC_BUILT_IN);

#if ESP_ARDUINO_VERSION_MAJOR >= 2
#if ESP_ARDUINO_VERSION_PATCH == 0
    m_i2s_config.communication_format =
        (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_I2S); // vers == 2.0.0
#else
    // V2.0.1 ... V2.0.4 will not work
    m_i2s_config.communication_format =
        (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_MSB); // vers >= 2.0.5
#endif
#else
    m_i2s_config.communication_format =
        (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S_MSB);
#endif

    i2s_driver_install((i2s_port_t)m_i2s_num, &m_i2s_config, 0, NULL);
    i2s_set_dac_mode((i2s_dac_mode_t)m_f_channelEnabled);
    if (m_f_channelEnabled != I2S_DAC_CHANNEL_BOTH_EN) {
      m_f_forceMono = true;
    }

#endif

  } else {
    m_i2s_config.mode = (i2s_mode_t)(I2S_MODE_MASTER | I2S_MODE_TX);

#if ESP_ARDUINO_VERSION_MAJOR >= 2
    m_i2s_config.communication_format =
        (i2s_comm_format_t)(I2S_COMM_FORMAT_STAND_I2S); // Arduino vers. > 2.0.0
#else
    m_i2s_config.communication_format =
        (i2s_comm_format_t)(I2S_COMM_FORMAT_I2S | I2S_COMM_FORMAT_I2S_MSB);
#endif

    i2s_driver_install((i2s_port_t)m_i2s_num, &m_i2s_config, 0, NULL);
    m_f_forceMono = false;
  }

