vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  char rqh[strlen(h_host) + 200]; // http request header
  rqh[0] = '\0';

  strcat(rqh, "GET ");
  strcat(rqh, extension);
  strcat(rqh, " HTTP/1.1\r\n");
  strcat(rqh, "Host: ");
  strcat(rqh, hostwoext);
  strcat(rqh, "\r\n");
  strcat(rqh, "Accept-Encoding: identity;q=1,*;q=0\r\n");
  //    strcat(rqh, "User-Agent: Mozilla/5.0\r\n"); #363
  strcat(rqh, "Connection: keep-alive\r\n\r\n");

  if (m_f_ssl) {
    _client = static_cast<WiFiClient *>(&clientsecure);
    if (port == 80)
      port = 443;
  } else {
    _client = static_cast<WiFiClient *>(&client);
  }

  if (!_client->connected()) {
    AUDIO_INFO("The host has disconnected, reconnecting");
    if (!_client->connect(hostwoext, port)) {
      log_e("connection lost");
      stopSong();
      return false;
    }
  }
  _client->print(rqh);

  if (endsWith(extension, ".mp3"))
    m_expectedCodec = CODEC_MP3;
  if (endsWith(extension, ".aac"))
    m_expectedCodec = CODEC_AAC;
  if (endsWith(extension, ".wav"))
    m_expectedCodec = CODEC_WAV;
  if (endsWith(extension, ".m4a"))
    m_expectedCodec = CODEC_M4A;
  if (endsWith(extension, ".flac"))
    m_expectedCodec = CODEC_FLAC;
  if (endsWith(extension, ".asx"))
    m_expectedPlsFmt = FORMAT_ASX;
  if (endsWith(extension, ".m3u"))
    m_expectedPlsFmt = FORMAT_M3U;
  if (endsWith(extension, ".m3u8"))
    m_expectedPlsFmt = FORMAT_M3U8;
  if (endsWith(extension, ".pls"))
    m_expectedPlsFmt = FORMAT_PLS;

  setDatamode(HTTP_RESPONSE_HEADER); // Handle header
  m_streamType = ST_WEBSTREAM;
  m_contentlength = 0;
  m_f_chunked = false;

  if (hostwoext) {
    free(hostwoext);
    hostwoext = NULL;
  }
  if (extension) {
    free(extension);
    extension = NULL;
  }
  if (h_host) {
    free(h_host);
    h_host = NULL;
  }
  return true;
}
#endif // AUDIO_NO_NETWORK
//---------------------------------------------------------------------------------------------------------------------
bool Audio::setFileLoop(bool input) {
  if (m_codec == CODEC_M4A)
    return 0;
  m_f_loop = input;
  return input;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::UTF8toASCII(char *str) {

#ifdef SDFATFS_USED
  // UTF8->UTF16 (lowbyte)
  const uint8_t ascii[60] = {
      // 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
      // 143, 144, 145, 146, 147, 148  // UTF8(C3)
      //                Ä    Å    Æ    Ç         É Ñ                  // CHAR
      000, 000, 000, 0xC4, 143, 0xC6, 0xC7, 000, 0xC9, 000, 000, 000, 000, 000,
      000, 000, 0xD1, 000, 000, 000, // ASCII (Latin1)
      // 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162,
      // 163, 164, 165, 166, 167, 168
      //      Ö                             Ü              ß    à ä    å    æ è
      000, 0xD6, 000, 000, 000, 000, 000, 0xDC, 000, 000, 0xDF, 0xE0, 000, 000,
      000, 0xE4, 0xE5, 0xE6, 000, 0xE8,
      // 169, 170, 171, 172. 173. 174. 175, 176, 177, 179, 179, 180, 181, 182,
      // 183, 184, 185, 186, 187, 188
      //      ê    ë    ì         î    ï         ñ    ò         ô         ö ù û
      //      ü
      000, 0xEA, 0xEB, 0xEC, 000, 0xEE, 0xEB, 000, 0xF1, 0xF2, 000, 0xF4, 000,
      0xF6, 000, 000, 0xF9, 000, 0xFB, 0xFC};
#else
  const uint8_t ascii[60] = {
      // 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
      // 143, 144, 145, 146, 147, 148  // UTF8(C3)
      //                Ä    Å    Æ    Ç         É Ñ                  // CHAR
      000, 000, 000, 142, 143, 146, 128, 000, 144, 000, 000, 000, 000, 000, 000,
      000, 165, 000, 000, 000, // ASCII
      // 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162,
      // 163, 164, 165, 166, 167, 168
      //      Ö                             Ü              ß    à ä    å    æ è
      000, 153, 000, 000, 000, 000, 000, 154, 000, 000, 225, 133, 000, 000, 000,
      132, 134, 145, 000, 138,
      // 169, 170, 171, 172. 173. 174. 175, 176, 177, 179, 179, 180, 181, 182,
      // 183, 184, 185, 186, 187, 188
      //      ê    ë    ì         î    ï         ñ    ò         ô         ö ù û
      //      ü
      000, 136, 137, 141, 000, 140, 139, 000, 164, 149, 000, 147, 000, 148, 000,
      000, 151, 000, 150, 129};
#endif

  uint16_t i = 0, j = 0, s = 0;
  bool f_C3_seen = false;

  while (str[i] != 0) {  // convert UTF8 to ASCII
    if (str[i] == 195) { // C3
      i++;
      f_C3_seen = true;
      continue;
    }
    str[j] = str[i];
    if (str[j] > 128 && str[j] < 189 && f_C3_seen == true) {
      s = ascii[str[j] - 129];
      if (s != 0)
        str[j] = s; // found a related ASCII sign
      f_C3_seen = false;
    }
    i++;
    j++;
  }
  str[j] = 0;
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::connecttoSD(const char *path, uint32_t resumeFilePos) {
  return connecttoFS(SD, path, resumeFilePos);
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::connecttoFS(fs::FS &fs, const char *path, uint32_t resumeFilePos) {

  if (strlen(path) > 255)
    return false;

  m_resumeFilePos = resumeFilePos;
  char audioName[256];
  setDefaults(); // free buffers an set defaults
  memcpy(audioName, path, strlen(path) + 1);
  if (audioName[0] != '/') {
    for (int i = 255; i > 0; i--) {
      audioName[i] = audioName[i - 1];
    }
    audioName[0] = '/';
  }

  AUDIO_INFO("Reading file: \"%s\"", audioName);
  vTaskDelay(2);

  if (fs.exists(audioName)) {
    audiofile = fs.open(audioName); // #86
  } else {
    UTF8toASCII(audioName);
    if (fs.exists(audioName)) {
      audiofile = fs.open(audioName);
    }
  }

  if (!audiofile) {
    if (audio_info) {
      vTaskDelay(2);
      audio_info("Failed to open file for reading");
    }
    return false;
  }

  setDatamode(AUDIO_LOCALFILE);
  m_file_size = audiofile.size(); // TEST loop

  char *afn = NULL; // audioFileName

#ifdef SDFATFS_USED
  audiofile.getName(m_chbuf, sizeof(m_chbuf));
  afn = strdup(m_chbuf);
#else
  afn = strdup(audiofile.name());
#endif

  uint8_t dotPos = lastIndexOf(afn, ".");
  for (uint8_t i = dotPos + 1; i < strlen(afn); i++) {
    afn[i] = toLowerCase(afn[i]);
  }

  if (endsWith(afn, ".mp3"))
    m_codec = CODEC_MP3; // m_codec is by default CODEC_NONE
  if (endsWith(afn, ".m4a"))
    m_codec = CODEC_M4A;
  if (endsWith(afn, ".aac"))
    m_codec = CODEC_AAC;
  if (endsWith(afn, ".wav"))
    m_codec = CODEC_WAV;
  if (endsWith(afn, ".flac"))
    m_codec = CODEC_FLAC;

  if (m_codec == CODEC_NONE)
    AUDIO_INFO("The %s format is not supported", afn + dotPos);

