vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  while (m < len - 1) {
    if ((buff[m] == 0xFE) && (buff[m + 1] == 0xFF)) {
      bitorder = true;
      j = m + 2;
    } // LSB/MSB
    if ((buff[m] == 0xFF) && (buff[m + 1] == 0xFE)) {
      bitorder = false;
      j = m + 2;
    } // MSB/LSB
    m++;
  } // seek for last bitorder
  m = 0;
  if (j > 0) {
    for (k = j; k < len; k += 2) {
      if (bitorder == true) {
        uni_h = (uint8_t)buff[k];
        uni_l = (uint8_t)buff[k + 1];
      } else {
        uni_l = (uint8_t)buff[k];
        uni_h = (uint8_t)buff[k + 1];
      }

      uint16_t uni_hl = ((uni_h << 8) | uni_l);

      if (uni_hl < 0X80) {
        tmpbuff[m] = uni_l;
        m++;
      } else if (uni_hl < 0X800) {
        tmpbuff[m] = ((uni_hl >> 6) | 0XC0);
        m++;
        tmpbuff[m] = ((uni_hl & 0X3F) | 0X80);
        m++;
      } else {
        tmpbuff[m] = ((uni_hl >> 12) | 0XE0);
        m++;
        tmpbuff[m] = (((uni_hl >> 6) & 0X3F) | 0X80);
        m++;
        tmpbuff[m] = ((uni_hl & 0X3F) | 0X80);
        m++;
      }
    }
  }
  buff[m] = 0;
  memcpy(buff, tmpbuff, m);
  if (tmpbuff) {
    free(tmpbuff);
    tmpbuff = NULL;
  }
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::latinToUTF8(char *buff, size_t bufflen) {
  // most stations send  strings in UTF-8 but a few sends in latin. To
  // standardize this, all latin strings are converted to UTF-8. If UTF-8 is
  // already present, nothing is done and true is returned. A conversion to
  // UTF-8 extends the string. Therefore it is necessary to know the buffer
  // size. If the converted string does not fit into the buffer, false is
  // returned utf8 bytelength: >=0xF0 3 bytes, >=0xE0 2 bytes, >=0xC0 1 byte,
  // e.g. e293ab is ⓫

  uint16_t pos = 0;
  uint8_t ext_bytes = 0;
  uint16_t len = strlen(buff);
  uint8_t c;

  while (pos < len) {
    c = buff[pos];
    if (c >= 0xC2) { // is UTF8 char
      pos++;
      if (c >= 0xC0 && buff[pos] < 0x80) {
        ext_bytes++;
        pos++;
      }
      if (c >= 0xE0 && buff[pos] < 0x80) {
        ext_bytes++;
        pos++;
      }
      if (c >= 0xF0 && buff[pos] < 0x80) {
        ext_bytes++;
        pos++;
      }
    } else
      pos++;
  }
  if (!ext_bytes)
    return true; // is UTF-8, do nothing

  pos = 0;

  while (buff[pos] != 0) {
    len = strlen(buff);
    if (buff[pos] >= 0x80 && buff[pos + 1] < 0x80) { // is not UTF8, is latin?
      for (int i = len + 1; i > pos; i--) {
        buff[i + 1] = buff[i];
      }
      uint8_t c = buff[pos];
      buff[pos++] = 0xc0 | ((c >> 6) & 0x1f); // 2+1+5 bits
      buff[pos++] = 0x80 | ((char)c & 0x3f);  // 1+1+6 bits
    }
    pos++;
    if (pos > bufflen - 3) {
      buff[bufflen - 1] = '\0';
      return false; // do not overwrite
    }
  }
  return true;
}
//---------------------------------------------------------------------------------------------------------------------
size_t Audio::readAudioHeader(uint32_t bytes) {
  size_t bytesReaded = 0;
  if (m_codec == CODEC_WAV) {
    int res = read_WAV_Header(InBuff.getReadPtr(), bytes);
    if (res >= 0)
      bytesReaded = res;
    else { // error, skip header
      m_controlCounter = 100;
    }
  }
  if (m_codec == CODEC_MP3) {
    int res = read_ID3_Header(InBuff.getReadPtr(), bytes);
    if (res >= 0)
      bytesReaded = res;
    else { // error, skip header
      m_controlCounter = 100;
    }
  }
  if (m_codec == CODEC_M4A) {
    int res = read_M4A_Header(InBuff.getReadPtr(), bytes);
    if (res >= 0)
      bytesReaded = res;
    else { // error, skip header
      m_controlCounter = 100;
    }
  }
  if (m_codec == CODEC_AAC) {
    // stream only, no header
    m_audioDataSize = getFileSize();
    m_controlCounter = 100;
  }
  if (m_codec == CODEC_FLAC) {
    int res = read_FLAC_Header(InBuff.getReadPtr(), bytes);
    if (res >= 0)
      bytesReaded = res;
    else { // error, skip header
      stopSong();
      m_controlCounter = 100;
    }
  }
  if (!isRunning()) {
    log_e("Processing stopped due to invalid audio header");
    return 0;
  }
  return bytesReaded;
}
//---------------------------------------------------------------------------------------------------------------------
int Audio::read_WAV_Header(uint8_t *data, size_t len) {
  static size_t headerSize;
  static uint32_t cs = 0;
  static uint8_t bts = 0;

  if (m_controlCounter == 0) {
    m_controlCounter++;
    if ((*data != 'R') || (*(data + 1) != 'I') || (*(data + 2) != 'F') ||
        (*(data + 3) != 'F')) {
      AUDIO_INFO("file has no RIFF tag");
      headerSize = 0;
      return -1; // false;
    } else {
      headerSize = 4;
      return 4; // ok
    }
  }

  if (m_controlCounter == 1) {
    m_controlCounter++;
    cs = (uint32_t)(*data + (*(data + 1) << 8) + (*(data + 2) << 16) +
                    (*(data + 3) << 24) - 8);
    headerSize += 4;
    return 4; // ok
  }

  if (m_controlCounter == 2) {
    m_controlCounter++;
    if ((*data != 'W') || (*(data + 1) != 'A') || (*(data + 2) != 'V') ||
        (*(data + 3) != 'E')) {
      AUDIO_INFO("format tag is not WAVE");
      return -1; // false;
    } else {
      headerSize += 4;
      return 4;
    }
  }

  if (m_controlCounter == 3) {
    if ((*data == 'f') && (*(data + 1) == 'm') && (*(data + 2) == 't')) {
      m_controlCounter++;
      headerSize += 4;
      return 4;
    } else {
      headerSize += 4;
      return 4;
    }
  }

  if (m_controlCounter == 4) {
    m_controlCounter++;
    cs = (uint32_t)(*data + (*(data + 1) << 8));
    if (cs > 40)
      return -1;   // false, something going wrong
    bts = cs - 16; // bytes to skip if fmt chunk is >16
    headerSize += 4;
    return 4;
  }

  if (m_controlCounter == 5) {
    m_controlCounter++;
    uint16_t fc = (uint16_t)(*(data + 0) + (*(data + 1) << 8)); // Format code
    uint16_t nic =
        (uint16_t)(*(data + 2) +
                   (*(data + 3) << 8)); // Number of interleaved channels
    uint32_t sr =
        (uint32_t)(*(data + 4) + (*(data + 5) << 8) + (*(data + 6) << 16) +
                   (*(data + 7) << 24)); // Samplerate
    uint32_t dr =
        (uint32_t)(*(data + 8) + (*(data + 9) << 8) + (*(data + 10) << 16) +
                   (*(data + 11) << 24)); // Datarate
    uint16_t dbs =
        (uint16_t)(*(data + 12) + (*(data + 13) << 8)); // Data block size
    uint16_t bps =
        (uint16_t)(*(data + 14) + (*(data + 15) << 8)); // Bits per sample

