vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  static size_t id3Size;
  static size_t headerSize;
  static uint8_t ID3version;
  static int ehsz = 0;
  static char tag[5];
  static char frameid[5];
  static size_t framesize = 0;
  static bool compressed = false;
  static bool APIC_seen = false;
  static size_t APIC_size = 0;
  static uint32_t APIC_pos = 0;
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter == 0) { /* read ID3 tag and ID3 header size */
    if (getDatamode() == AUDIO_LOCALFILE) {
      ID3version = 0;
#ifndef AUDIO_NO_NETWORK
      m_contentlength = getFileSize();
      AUDIO_INFO("Content-Length: %u", m_contentlength);
#endif
    }
    m_controlCounter++;
    APIC_seen = false;
    headerSize = 0;
    ehsz = 0;
    if (specialIndexOf(data, "ID3", 4) != 0) { // ID3 not found
#ifndef AUDIO_NO_NETWORK
      if (!m_f_m3u8data)
        AUDIO_INFO("file has no mp3 tag, skip metadata");
      m_audioDataSize = m_contentlength;
#ifndef AUDIO_NO_NETWORK
      if (!m_f_m3u8data)
        AUDIO_INFO("Audio-Length: %u", m_audioDataSize);
#else
      AUDIO_INFO("Audio-Length: %u", m_audioDataSize);
#endif
#else
      AUDIO_INFO("file has no mp3 tag, skip metadata");
      m_audioDataSize = getFileSize();
      AUDIO_INFO("Audio-Length: %u", m_audioDataSize);
#endif
      return -1; // error, no ID3 signature found
    }
    ID3version = *(data + 3);
    switch (ID3version) {
    case 2:
      m_f_unsync = (*(data + 5) & 0x80);
      m_f_exthdr = false;
      break;
    case 3:
    case 4:
      m_f_unsync = (*(data + 5) & 0x80); // bit7
      m_f_exthdr = (*(data + 5) & 0x40); // bit6 extended header
      break;
    };
    id3Size =
        bigEndian(data + 6, 4,
                  7); //  ID3v2 size  4 * %0xxxxxxx (shift left seven times!!)
    id3Size += 10;

    // Every read from now may be unsync'd
#ifndef AUDIO_NO_NETWORK
    if (!m_f_m3u8data)
      AUDIO_INFO("ID3 framesSize: %i", id3Size);
    if (!m_f_m3u8data)
      AUDIO_INFO("ID3 version: 2.%i", ID3version);
#else
    AUDIO_INFO("ID3 framesSize: %i", id3Size);
    AUDIO_INFO("ID3 version: 2.%i", ID3version);
#endif

    if (ID3version == 2) {
      m_controlCounter = 10;
    }
    headerSize = id3Size;
    m_ID3Size = id3Size;
    headerSize -= 10;

    return 10;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter == 1) { // compute extended header size if exists
    m_controlCounter++;
    if (m_f_exthdr) {
      AUDIO_INFO("ID3 extended header");
      ehsz = bigEndian(data, 4);
      headerSize -= 4;
      ehsz -= 4;
      return 4;
    } else {
#ifndef AUDIO_NO_NETWORK
      if (!m_f_m3u8data)
        AUDIO_INFO("ID3 normal frames");
#else
      AUDIO_INFO("ID3 normal frames");
#endif
      return 0;
    }
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter == 2) { // skip extended header if exists
    if (ehsz > 256) {
      ehsz -= 256;
      headerSize -= 256;
      return 256;
    } // Throw it away
    else {
      m_controlCounter++;
      headerSize -= ehsz;
      return ehsz;
    } // Throw it away
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter == 3) { // read a ID3 frame, get the tag
    if (headerSize == 0) {
      m_controlCounter = 99;
      return 0;
    }
    m_controlCounter++;
    frameid[0] = *(data + 0);
    frameid[1] = *(data + 1);
    frameid[2] = *(data + 2);
    frameid[3] = *(data + 3);
    frameid[4] = 0;
    for (uint8_t i = 0; i < 4; i++)
      tag[i] = frameid[i]; // tag = frameid

    headerSize -= 4;
    if (frameid[0] == 0 && frameid[1] == 0 && frameid[2] == 0 &&
        frameid[3] == 0) {
      // We're in padding
      m_controlCounter = 98; // all ID3 metadata processed
    }
    return 4;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter == 4) { // get the frame size
    m_controlCounter = 6;

    if (ID3version == 4) {
      framesize = bigEndian(data, 4, 7); // << 7
    } else {
      framesize = bigEndian(data, 4); // << 8
    }
    headerSize -= 4;
    uint8_t flag = *(data + 4); // skip 1st flag
    (void)flag;
    headerSize--;
    compressed = (*(data + 5)) &
                 0x80; // Frame is compressed using [#ZLIB zlib] with 4 bytes
                       // for 'decompressed size' appended to the frame header.
    headerSize--;
    uint32_t decompsize = 0;
    if (compressed) {
      if (m_f_Log)
        log_i("iscompressed");
      decompsize = bigEndian(data + 6, 4);
      headerSize -= 4;
      (void)decompsize;
      if (m_f_Log)
        log_i("decompsize=%u", decompsize);
      return 6 + 4;
    }
    return 6;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter ==
      5) { // If the frame is larger than 256 bytes, skip the rest
    if (framesize > 256) {
      framesize -= 256;
      headerSize -= 256;
      return 256;
    } else {
      m_controlCounter = 3; // check next frame
      headerSize -= framesize;
      return framesize;
    }
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter == 6) { // Read the value
    m_controlCounter = 5;      // only read 256 bytes
    char value[256];
    char ch = *(data + 0);
    // $00 – ISO-8859-1 (LATIN-1, Identical to ASCII for values smaller than
    // 0x80). $01 – UCS-2 encoded Unicode with BOM, in ID3v2.2 and ID3v2.3. $02
    // – UTF-16BE encoded Unicode without BOM, in ID3v2.4. $03 – UTF-8 encoded
    // Unicode, in ID3v2.4.
    bool isUnicode = (ch == 1) ? true : false;

    if (startsWith(tag, "APIC")) { // a image embedded in file, passing it to
                                   // external function
      isUnicode = false;
      if (getDatamode() == AUDIO_LOCALFILE) {
        APIC_seen = true;
        APIC_pos = id3Size - headerSize;
        APIC_size = framesize;
      }
      return 0;
    }

    size_t fs = framesize;
    if (fs > 255)
      fs = 255;
    for (int i = 0; i < fs; i++) {
      value[i] = *(data + i);
    }
    framesize -= fs;
    headerSize -= fs;
    value[fs] = 0;
    if (isUnicode && fs > 1) {
      unicode2utf8(value, fs); // convert unicode to utf-8 U+0020...U+07FF
    }
    if (!isUnicode) {
      uint16_t j = 0, k = 0;
      j = 0;
      k = 0;
      while (j < fs) {
        if (value[j] == 0x0A)
          value[j] = 0x20; // replace LF by space
        if (value[j] > 0x1F) {
          value[k] = value[j];
          k++;
        }
        j++;
      } // remove non printables
      if (k > 0)
        value[k] = 0;
      else
        value[0] = 0; // new termination
    }
    showID3Tag(tag, value);
    return fs;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -

