vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  if (retvalue) {
    if (retvalue > len) { // if returnvalue > bufferfillsize
      if (len > InBuff.getMaxBlockSize())
        len = InBuff.getMaxBlockSize();
      retvalue -= len; // and wait for more bufferdata
      return len;
    } else {
      size_t tmp = retvalue;
      retvalue = 0;
      return tmp;
    }
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter == OGG_BEGIN) { // init
    retvalue = 0;
    m_audioDataStart = 0;
    f_firstPacket = true;
    m_controlCounter = OGG_MAGIC;
    if (getDatamode() == AUDIO_LOCALFILE) {
#ifndef AUDIO_NO_NETWORK
      m_contentlength = getFileSize();
      AUDIO_INFO("Content-Length: %u", m_contentlength);
#endif
    }
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter == OGG_MAGIC) { /* check MAGIC STRING */
    if (specialIndexOf(data, "OggS", 10) != 0) {
      log_e("Magic String 'OggS' not found in header");
      stopSong();
      return -1;
    }
    m_controlCounter = OGG_HEADER;
    retvalue = 4;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter == OGG_HEADER) { /* check OGG PAGE HEADER */
    uint8_t i = 0;
    uint8_t ssv = *(data + i); // stream_structure_version
    (void)ssv;
    i++;
    uint8_t htf = *(data + i); // header_type_flag
    (void)htf;
    i++;
    uint32_t tmp = bigEndian(data + i, 4); // absolute granule position
    uint64_t agp = (uint64_t)tmp << 32;
    i += 4;
    agp += bigEndian(data + i, 4);
    i += 4;
    uint32_t ssnr = bigEndian(data + i, 4); // stream serial number
    (void)ssnr;
    i += 4;
    uint32_t psnr = bigEndian(data + i, 4); // page sequence no
    (void)psnr;
    i += 4;
    uint32_t pchk = bigEndian(data + i, 4); // page checksum
    (void)pchk;
    i += 4;
    uint8_t psegm = *(data + i);
    i++;
    uint8_t psegmBuff[256];
    pageLen = 0;
    for (uint8_t j = 0; j < psegm; j++) {
      psegmBuff[j] = *(data + i);
      pageLen += psegmBuff[j];
      i++;
    }
    retvalue = i;
    if (agp == 0) {
      if (f_firstPacket == true) {
        f_firstPacket = false;
        m_controlCounter = OGG_FIRST; // ogg first pages
      } else {
        retvalue += pageLen;
        m_controlCounter = OGG_MAGIC;
      }
    } else {
      if (m_codec == CODEC_OGG_FLAC) {
        m_controlCounter = OGG_AMRDY;
      } else {
        AUDIO_INFO("unknown format");
        stopSong();
        return -1;
      }
    }
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - -
  if (m_controlCounter ==
      OGG_FIRST) { /* check OGG FIRST PAGES (has no streaming content) */
    uint8_t i = 0;
    uint8_t obp = *(data + i); // oneBytePacket shold be 0x7F
    (void)obp;
    i++;
    if (specialIndexOf(data + i, "FLAC", 10) == 0) {
    } else {
      log_e(
          "ogg/flac support only"); // ogg/vorbis or ogg//opus not supported yet
      stopSong();
      return -1;
    }
    i += 4;
    uint8_t major_vers = *(data + i);
    (void)major_vers;
    i++;
    uint8_t minor_vers = *(data + i);
    (void)minor_vers;
    i++;
    uint16_t nonah =
        bigEndian(data + i, 2); // number of non audio headers (0x00 = unknown)
    (void)nonah;
    i += 2;
    if (specialIndexOf(data + i, "fLaC", 10) == 0) {
      m_codec = CODEC_OGG_FLAC;
    }
    i += 4;
    // STREAMINFO metadata block begins
    uint32_t mblen = bigEndian(data + i, 4);
    (void)mblen;
    i += 4; // skip metadata block header + length
    i += 2; // skip minimun block size
    m_flacMaxBlockSize = bigEndian(data + i, 2);
    i += 2;
    vTaskDelay(2);
    AUDIO_INFO("FLAC maxBlockSize: %u", m_flacMaxBlockSize);
    i += 3; // skip minimun frame size
    vTaskDelay(2);
    m_flacMaxFrameSize = bigEndian(data + i, 3);
    i += 3;
    if (m_flacMaxFrameSize) {
      AUDIO_INFO("FLAC maxFrameSize: %u", m_flacMaxFrameSize);
    } else {
      AUDIO_INFO("FLAC maxFrameSize: N/A");
    }
    if (m_flacMaxFrameSize > InBuff.getMaxBlockSize()) {
      log_e("FLAC maxFrameSize too large!");
      stopSong();
      return -1;
    }
    vTaskDelay(2);
    uint32_t nextval = bigEndian(data + i, 3);
    i += 3;
    m_flacSampleRate = nextval >> 4;
    AUDIO_INFO("FLAC sampleRate: %u", m_flacSampleRate);
    vTaskDelay(2);
    m_flacNumChannels = ((nextval & 0x06) >> 1) + 1;
    AUDIO_INFO("FLAC numChannels: %u", m_flacNumChannels);
    if (m_flacNumChannels != 1 && m_flacNumChannels != 2) {
      vTaskDelay(2);
      AUDIO_INFO("numChannels must be 1 or 2");
      stopSong();
      return -1;
    }
    vTaskDelay(2);
    uint8_t bps = (nextval & 0x01) << 4;
    bps += (*(data + i) >> 4) + 1;
    i++;
    m_flacBitsPerSample = bps;
    if ((bps != 8) && (bps != 16)) {
      log_e("bits per sample must be 8 or 16, is %i", bps);
      stopSong();
      return -1;
    }
    AUDIO_INFO("FLAC bitsPerSample: %u", m_flacBitsPerSample);
    m_flacTotalSamplesInStream = bigEndian(data + i, 4);
    i++;
    if (m_flacTotalSamplesInStream) {
      AUDIO_INFO("total samples in stream: %u", m_flacTotalSamplesInStream);
    } else {
      AUDIO_INFO("total samples in stream: N/A");
    }
    if (bps != 0 && m_flacTotalSamplesInStream) {
      AUDIO_INFO("audio file duration: %u seconds",
                 m_flacTotalSamplesInStream / m_flacSampleRate);
    }
    m_controlCounter = OGG_MAGIC;
    retvalue = pageLen;
    return 0;
  }
  if (m_controlCounter == OGG_AMRDY) { // ogg almost ready
    if (!psramFound()) {
      AUDIO_INFO("FLAC works only with PSRAM!");
      m_f_running = false;
      stopSong();
      return -1;
    }
    if (!FLACDecoder_AllocateBuffers()) {
      m_f_running = false;
      stopSong();
      return -1;
    }
    InBuff.changeMaxBlockSize(m_frameSizeFLAC);
    AUDIO_INFO("FLACDecoder has been initialized, free Heap: %u bytes",
               ESP.getFreeHeap());

    m_controlCounter = OGG_OKAY; // 100
    retvalue = 0;
    return 0;
  }
  return 0;
}
//---------------------------------------------------------------------------------------------------------------------
size_t Audio::process_m3u8_ID3_Header(uint8_t *packet) {
  uint8_t ID3version;
  size_t id3Size;
  bool m_f_unsync = false, m_f_exthdr = false;
  uint64_t current_timestamp = 0;

  (void)m_f_unsync;        // suppress -Wunused-variable
  (void)current_timestamp; // suppress -Wunused-variable

