vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
exit:
  m_f_running = false;
  stopSong();
  vector_clear_and_shrink(m_playlistContent);
  setDatamode(AUDIO_NONE);
  return nullptr;
}
//----------------------------------------------------------------------------------------------------------------------
const char *Audio::parsePlaylist_ASX() { // Advanced Stream Redirector
  uint8_t lines = m_playlistContent.size();
  bool f_entry = false;
  int pos = 0;
  char *host = nullptr;

  for (int i = 0; i < lines; i++) {
    int p1 = indexOf(m_playlistContent[i], "<", 0);
    int p2 = indexOf(m_playlistContent[i], ">", 1);
    if (p1 >= 0 && p2 > p1) { // #196 set all between "< ...> to lowercase
      for (uint8_t j = p1; j < p2; j++) {
        m_playlistContent[i][j] = toLowerCase(m_playlistContent[i][j]);
      }
    }
    if (indexOf(m_playlistContent[i], "<entry>") >= 0)
      f_entry = true; // found entry tag (returns -1 if not found)
    if (f_entry) {
      if (indexOf(m_playlistContent[i], "ref href") >
          0) { //  <ref href="http://87.98.217.63:24112/stream" />
        pos = indexOf(m_playlistContent[i], "http", 0);
        if (pos > 0) {
          host = (m_playlistContent[i] +
                  pos); // http://87.98.217.63:24112/stream" />
          int pos1 = indexOf(host, "\"", 0); // http://87.98.217.63:24112/stream
          if (pos1 > 0)
            host[pos1] = '\0'; // Now we have an URL for a stream in host.
        }
      }
    }
    pos = indexOf(m_playlistContent[i], "<title>", 0);
    if (pos >= 0) {
      char *plsStationName = (m_playlistContent[i] + pos + 7); // remove <Title>
      pos = indexOf(plsStationName, "</", 0);
      if (pos >= 0) {
        *(plsStationName + pos) = 0; // remove </Title>
      }
      if (audio_showstation)
        audio_showstation(plsStationName);
      AUDIO_INFO("StationName: \"%s\"", plsStationName);
    }

    if (indexOf(m_playlistContent[i], "http") == 0 &&
        !f_entry) { // url only in asx
      host = m_playlistContent[i];
    }
  }
  return host;
}
#endif // AUDIO_NO_NETWORK
//----------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
const char *Audio::parsePlaylist_M3U8() {
  uint8_t lines = m_playlistContent.size();
  bool f_begin = false;
  uint8_t occurence = 0;
  if (lines) {
    for (int i = 0; i < lines; i++) {
      if (strlen(m_playlistContent[i]) == 0)
        continue;                                        // empty line
      if (startsWith(m_playlistContent[i], "#EXTM3U")) { // what we expected
        f_begin = true;
        continue;
      }
      if (!f_begin)
        continue;

      // example: redirection
      // #EXTM3U
      // #EXT-X-STREAM-INF:BANDWIDTH=22050,CODECS="mp4a.40.2"
      // http://ample.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/playlist.m3u8
      if (startsWith(m_playlistContent[i], "#EXT-X-STREAM-INF:")) {
        if (occurence > 0)
          break; // no more than one #EXT-X-STREAM-INF: (can have different
                 // BANDWIDTH)
        occurence++;
        if ((!endsWith(m_playlistContent[i + 1], "m3u8") &&
             indexOf(m_playlistContent[i + 1], "m3u8?") == -1)) {
          // we have a new m3u8 playlist, skip to next line
          int pos = indexOf(m_playlistContent[i], "CODECS=\"mp4a", 18);
          // 'mp4a.40.01' AAC Main
          // 'mp4a.40.02' AAC LC (Low Complexity)
          // 'mp4a.40.03' AAC SSR (Scalable Sampling Rate) ??
          // 'mp4a.40.03' AAC LTP (Long Term Prediction) ??
          // 'mp4a.40.03' SBR (Spectral Band Replication)
          if (pos < 0) { // not found
            int pos1 = indexOf(m_playlistContent[i], "CODECS=", 18);
            if (pos1 < 0)
              pos1 = 0;
            log_e("codec %s in m3u8 playlist not supported",
                  m_playlistContent[i] + pos1);
            goto exit;
          }
        }
        i++; // next line
        if (i == lines)
          continue; // and exit for()

        char *tmp = nullptr;
        if (!startsWith(m_playlistContent[i], "http")) {
          // http://livees.com/prog_index.m3u8 and prog_index48347.aac -->
          // http://livees.com/prog_index48347.aac
          // http://livees.com/prog_index.m3u8 and chunklist022.m3u8   -->
          // http://livees.com/chunklist022.m3u8
          tmp =
              (char *)malloc(strlen(m_lastHost) + strlen(m_playlistContent[i]));
          strcpy(tmp, m_lastHost);
          int idx = lastIndexOf(tmp, "/");
          strcpy(tmp + idx + 1, m_playlistContent[i]);
        } else {
          tmp = strdup(m_playlistContent[i]);
        }
        if (m_playlistContent[i]) {
          free(m_playlistContent[i]);
          m_playlistContent[i] = NULL;
        }
        m_playlistContent[i] = strdup(tmp);
        strcpy(m_lastHost, tmp);
        if (tmp) {
          free(tmp);
          tmp = NULL;
        }
        if (m_f_Log)
          log_i("redirect %s", m_playlistContent[i]);
        return m_playlistContent[i]; // it's a redirection, a new m3u8 playlist
      }

      // example: audio chunks
      // #EXTM3U
      // #EXT-X-TARGETDURATION:10
      // #EXT-X-MEDIA-SEQUENCE:163374040
      // #EXT-X-DISCONTINUITY
      // #EXTINF:10,title="text=\"Spot Block End\"
      // amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\""
      // http://n3fa-e2.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/main/163374038.aac
      // #EXTINF:10,title="text=\"Spot Block End\"
      // amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\""
      // http://n3fa-e2.revma.ihrhls.com/zc7729/63_sdtszizjcjbz02/main/163374039.aac
      if (startsWith(m_playlistContent[i], "#EXT-X-MEDIA-SEQUENCE:")) {
        // do nothing, because MEDIA-SECUENCE is not set sometimes
      }
      static uint16_t targetDuration = 0;
      if (startsWith(m_playlistContent[i], "#EXT-X-TARGETDURATION:")) {
        targetDuration = atoi(m_playlistContent[i] + 22);
      }
      if (targetDuration)
        m_m3u8_targetDuration = targetDuration;
      if (m_f_Log)
        log_i("m_m3u8_targetDuration %d", m_m3u8_targetDuration);

      if (startsWith(m_playlistContent[i], "#EXTINF")) {
        if (STfromEXTINF(m_playlistContent[i]))
          showstreamtitle(m_chbuf);
        i++;
        if (i == lines)
          continue; // and exit for()

        char *tmp = nullptr;
        if (!startsWith(m_playlistContent[i], "http")) {
          // http://livees.com/prog_index.m3u8 and prog_index48347.aac -->
          // http://livees.com/prog_index48347.aac
          tmp =
              (char *)malloc(strlen(m_lastHost) + strlen(m_playlistContent[i]));
          strcpy(tmp, m_lastHost);
          int idx = lastIndexOf(tmp, "/");
          strcpy(tmp + idx + 1, m_playlistContent[i]);
        } else {
          tmp = strdup(m_playlistContent[i]);
        }

        uint32_t hash = simpleHash(tmp);
        if (m_hashQueue.size() == 0) {
          m_hashQueue.insert(m_hashQueue.begin(), hash);
          m_playlistURL.insert(m_playlistURL.begin(), strdup(tmp));
        } else {
          bool known = false;
          for (int i = 0; i < m_hashQueue.size(); i++) {
            if (hash == m_hashQueue[i]) {
              if (m_f_Log)
                log_i("file already known %s", tmp);
              known = true;
            }
          }
          if (!known) {
            m_hashQueue.insert(m_hashQueue.begin(), hash);
            m_playlistURL.insert(m_playlistURL.begin(), strdup(tmp));
          }
        }

        if (m_hashQueue.size() > 20)
          m_hashQueue.pop_back();

        if (tmp) {
          free(tmp);
          tmp = NULL;
        }

        if (m_playlistURL.size() == 20) {
          ESP_LOGD("", "can't stuff anymore");
          break;
        }
        continue;
      }
    }
    vector_clear_and_shrink(
        m_playlistContent); // clear after reading everything,
                            // m_playlistContent.size is now 0
  }
#endif // AUDIO_NO_NETWORK
//----------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
  if (m_playlistURL.size() > 0) {
    if (m_playlistBuff) {
      free(m_playlistBuff);
      m_playlistBuff = NULL;
    }

    if (m_playlistURL[m_playlistURL.size() - 1]) {
      m_playlistBuff = strdup(m_playlistURL[m_playlistURL.size() - 1]);
      free(m_playlistURL[m_playlistURL.size() - 1]);
      m_playlistURL[m_playlistURL.size() - 1] = NULL;
      m_playlistURL.pop_back();
      m_playlistURL.shrink_to_fit();
    }
    if (m_f_Log)
      log_i("now playing %s", m_playlistBuff);
    return m_playlistBuff;
  } else {
    return NULL;
  }
exit:
  stopSong();
  return NULL;
}
#endif // AUDIO_NO_NETWORK
//---------------------------------------------------------------------------------------------------------------------
bool Audio::STfromEXTINF(char *str) {
  // the result is copied in chbuf!!
  // extraxt StreamTitle from m3u #EXTINF line to icy-format
  // orig: #EXTINF:10,title="text="TitleName",artist="ArtistName"
  // conv: StreamTitle=TitleName - ArtistName
  // orig: #EXTINF:10,title="text=\"Spot Block End\"
  // amgTrackId=\"9876543\"",artist=" ",url="length=\"00:00:00\"" conv:
  // StreamTitle=text=\"Spot Block End\" amgTrackId=\"9876543\" -

  int t1, t2, t3, n0 = 0, n1 = 0, n2 = 0;

  t1 = indexOf(str, "title", 0);
  if (t1 > 0) {
    strcpy(m_chbuf, "StreamTitle=");
    n0 = 12;
    t2 = t1 + 7; // title="
    t3 = indexOf(str, "\"", t2);
    while (str[t3 - 1] == '\\') {
      t3 = indexOf(str, "\"", t3 + 1);
    }
    if (t2 < 0 || t2 > t3)
      return false;
    n1 = t3 - t2;
    strncpy(m_chbuf + n0, str + t2, n1);
    m_chbuf[n1] = '\0';
  }

  t1 = indexOf(str, "artist", 0);
  if (t1 > 0) {
    strcpy(m_chbuf + n0 + n1, " - ");
    n1 += 3;
    t2 = indexOf(str, "=\"", t1);
    t2 += 2;
    t3 = indexOf(str, "\"", t2);
    if (t2 < 0 || t2 > t3)
      return false;
    n2 = t3 - t2;
    strncpy(m_chbuf + n0 + n1, str + t2, n2);
    m_chbuf[n0 + n1 + n2] = '\0';
    m_chbuf[n2] = '\0';
  }
  return true;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::processLocalFile() {

  if (!(audiofile && m_f_running && getDatamode() == AUDIO_LOCALFILE))
    return; // guard

