vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  const uint32_t maxFrameSize =
      InBuff.getMaxBlockSize(); // every mp3/aac frame is not bigger
  static bool f_stream;
  static bool f_fileDataComplete;
  static uint32_t byteCounter; // count received data
  uint32_t availableBytes = 0;

  if (m_f_firstCall) { // runs only one time per connection, prepare for start
    m_f_firstCall = false;
    f_stream = false;
    f_fileDataComplete = false;
    byteCounter = 0;
    return;
  }

  availableBytes = 16 * 1024; // set some large value

  availableBytes = min(availableBytes, InBuff.writeSpace());
  availableBytes = min(availableBytes, audiofile.size() - byteCounter);
#ifndef AUDIO_NO_NETWORK
  if (m_contentlength) {
    if (m_contentlength > getFilePos())
      availableBytes = min(availableBytes, m_contentlength - getFilePos());
  }
#endif
  if (m_audioDataSize) {
    availableBytes =
        min(availableBytes, m_audioDataSize + m_audioDataStart - byteCounter);
  }

  int32_t bytesAddedToBuffer =
      audiofile.read(InBuff.getWritePtr(), availableBytes);

  if (bytesAddedToBuffer > 0) {
    byteCounter += bytesAddedToBuffer; // Pull request #42
    InBuff.bytesWritten(bytesAddedToBuffer);
  }
  if (!f_stream) {
    if (m_controlCounter != 100) {
      if (InBuff.bufferFilled() > maxFrameSize) { // read the file header first
        InBuff.bytesWasRead(readAudioHeader(InBuff.bufferFilled()));
      }
      return;
    } else {
      if ((InBuff.freeSpace() > maxFrameSize) &&
          (m_file_size - byteCounter) > maxFrameSize) {
        // fill the buffer before playing
        return;
      }

      f_stream = true;
      AUDIO_INFO("stream ready");
      if (m_f_Log)
        log_i("m_audioDataStart %d", m_audioDataStart);
    }
  }

  if (m_resumeFilePos) {
    if (m_resumeFilePos < m_audioDataStart)
      m_resumeFilePos = m_audioDataStart;
    if (m_resumeFilePos > m_file_size)
      m_resumeFilePos = m_file_size;
    if (m_codec == CODEC_M4A)
      m_resumeFilePos = m4a_correctResumeFilePos(m_resumeFilePos);
    if (m_codec == CODEC_WAV) {
      while ((m_resumeFilePos % 4) != 0)
        m_resumeFilePos++;
    } // must be divisible by four
    if (m_codec == CODEC_FLAC) {
      m_resumeFilePos = flac_correctResumeFilePos(m_resumeFilePos);
      FLACDecoderReset();
    }
    if (m_codec == CODEC_MP3) {
      m_resumeFilePos = mp3_correctResumeFilePos(m_resumeFilePos);
    }
    if (m_avr_bitrate)
      m_audioCurrentTime =
          ((m_resumeFilePos - m_audioDataStart) / m_avr_bitrate) * 8;
    audiofile.seek(m_resumeFilePos);
    InBuff.resetBuffer();
    byteCounter = m_resumeFilePos;

    if (m_f_Log) {
      log_i("m_resumeFilePos %d", m_resumeFilePos);
      log_i("m_audioDataStart %d", m_audioDataStart);
      log_i("m_audioCurrentTime %f", (double)m_audioCurrentTime);
      log_i("m_file_size %d", m_file_size);
    }
    m_resumeFilePos = 0;
    f_stream = false;
  }

  // end of file reached? - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - -
  if (f_fileDataComplete && InBuff.bufferFilled() < InBuff.getMaxBlockSize()) {
    if (InBuff.bufferFilled()) {
      if (!readID3V1Tag()) {
        int bytesDecoded =
            sendBytes(InBuff.getReadPtr(), InBuff.bufferFilled());
        if (bytesDecoded > 2) {
          InBuff.bytesWasRead(bytesDecoded);
          return;
        }
      }
    }
    playI2Sremains();

    if (m_f_loop && f_stream) { // eof
      AUDIO_INFO("loop from: %u to: %u", getFilePos(),
                 m_audioDataStart); // TEST loop
      setFilePos(m_audioDataStart);
      if (m_codec == CODEC_FLAC)
        FLACDecoderReset();
      /*
          The current time of the loop mode is not reset,
          which will cause the total audio duration to be exceeded.
          For example: current time   ====progress bar====>  total audio
         duration 3:43        ====================>        3:33
      */
      m_audioCurrentTime = 0;
      byteCounter = m_audioDataStart;
      f_fileDataComplete = false;
      return;
    } // TEST loop

#ifdef SDFATFS_USED
    audiofile.getName(m_chbuf, sizeof(m_chbuf));
    char *afn = strdup(m_chbuf);
#else
    char *afn = strdup(audiofile.name()); // store temporary the name
#endif

    stopSong();
    if (m_codec == CODEC_MP3)
      MP3Decoder_FreeBuffers();
    if (m_codec == CODEC_AAC)
      AACDecoder_FreeBuffers();
    if (m_codec == CODEC_M4A)
      AACDecoder_FreeBuffers();
    if (m_codec == CODEC_FLAC)
      FLACDecoder_FreeBuffers();
    AUDIO_INFO("End of file \"%s\"", afn);
    if (audio_eof_mp3)
      audio_eof_mp3(afn);
    if (afn) {
      free(afn);
      afn = NULL;
    }
    return;
  }

  if (byteCounter == audiofile.size()) {
    f_fileDataComplete = true;
  }
  if (byteCounter == m_audioDataSize + m_audioDataStart) {
    f_fileDataComplete = true;
  }

  // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (f_stream) {
    static uint8_t cnt = 0;
    uint8_t compression;
    if (m_codec == CODEC_WAV)
      compression = 1;
    else if (m_codec == CODEC_FLAC)
      compression = 2;
    else
      compression = 3;
    cnt++;
    if (cnt == compression) {
      playAudioData();
      cnt = 0;
    }
  }
  return;
}
//----------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
void Audio::processWebStream() {

  const uint16_t maxFrameSize =
      InBuff.getMaxBlockSize(); // every mp3/aac frame is not bigger
  static bool f_stream;         // first audio data received
  static uint32_t chunkSize;    // chunkcount read from stream

  // first call, set some values to default  - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (m_f_firstCall) { // runs only ont time per connection, prepare for start
    m_f_firstCall = false;
    f_stream = false;
    chunkSize = 0;
    m_metacount = m_metaint;
    readMetadata(0, true); // reset all static vars
  }

