vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  if (getDatamode() != AUDIO_DATA)
    return;                                       // guard
  uint32_t availableBytes = _client->available(); // available from stream
  // chunked data tramsfer - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (m_f_chunked && availableBytes) {
    uint8_t readedBytes = 0;
    if (!chunkSize)
      chunkSize = chunkedDataTransfer(&readedBytes);
    availableBytes = min(availableBytes, chunkSize);
  }
  // we have metadata  - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (m_f_metadata && availableBytes) {
    if (m_metacount == 0) {
      chunkSize -= readMetadata(availableBytes);
      return;
    }
    availableBytes = min(availableBytes, m_metacount);
  }

  slowStreamDetection(InBuff.bufferFilled(), maxFrameSize);
  if (f_stream)
    lostStreamDetection(availableBytes);

  // buffer fill routine - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (availableBytes) {
    availableBytes = min(availableBytes, InBuff.writeSpace());
    int16_t bytesAddedToBuffer =
        _client->read(InBuff.getWritePtr(), availableBytes);

    if (bytesAddedToBuffer > 0) {
      if (m_f_metadata)
        m_metacount -= bytesAddedToBuffer;
      if (m_f_chunked)
        chunkSize -= bytesAddedToBuffer;
      InBuff.bytesWritten(bytesAddedToBuffer);
    }

    if (InBuff.bufferFilled() > maxFrameSize &&
        !f_stream) {   // waiting for buffer filled
      f_stream = true; // ready to play the audio data
      AUDIO_INFO("stream ready");
    }
    if (!f_stream)
      return;
  }

  // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (f_stream) {
    static uint8_t cnt = 0;
    cnt++;
    if (cnt == 3) {
      playAudioData();
      cnt = 0;
    }
  }
}
#endif // AUDIO_NO_NETWORK
//---------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
void Audio::processWebFile() {

  const uint32_t maxFrameSize =
      InBuff.getMaxBlockSize();      // every mp3/aac frame is not bigger
  static bool f_stream;              // first audio data received
  static bool f_webFileDataComplete; // all file data received
  static uint32_t byteCounter;       // count received data
  static uint32_t chunkSize;         // chunkcount read from stream
  static size_t audioDataCount;      // counts the decoded audiodata only

  // first call, set some values to default - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (m_f_firstCall) { // runs only ont time per connection, prepare for start
    m_f_firstCall = false;
    f_webFileDataComplete = false;
    f_stream = false;
    byteCounter = 0;
    chunkSize = 0;
    audioDataCount = 0;
  }

  if (!m_contentlength && !m_f_tts) {
    log_e("webfile without contentlength!");
    stopSong();
    return;
  } // guard

  uint32_t availableBytes = _client->available(); // available from stream

  // chunked data tramsfer - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (m_f_chunked) {
    uint8_t readedBytes = 0;
    if (!chunkSize)
      chunkSize = chunkedDataTransfer(&readedBytes);
    availableBytes = min(availableBytes, chunkSize);
    if (m_f_tts)
      m_contentlength = chunkSize;
  }

  // if the buffer is often almost empty issue a warning  - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (!f_webFileDataComplete && f_stream) {
    slowStreamDetection(InBuff.bufferFilled(), maxFrameSize);
  }

  availableBytes = min(InBuff.writeSpace(), availableBytes);
  availableBytes = min(m_contentlength - byteCounter, availableBytes);
  if (m_audioDataSize)
    availableBytes =
        min(m_audioDataSize - (byteCounter - m_audioDataStart), availableBytes);

  int16_t bytesAddedToBuffer =
      _client->read(InBuff.getWritePtr(), availableBytes);

  if (bytesAddedToBuffer > 0) {
    byteCounter += bytesAddedToBuffer; // Pull request #42
    if (m_f_chunked)
      m_chunkcount -= bytesAddedToBuffer;
    if (m_controlCounter == 100)
      audioDataCount += bytesAddedToBuffer;
    InBuff.bytesWritten(bytesAddedToBuffer);
  }

  if (InBuff.bufferFilled() > maxFrameSize &&
      !f_stream) {   // waiting for buffer filled
    f_stream = true; // ready to play the audio data
    uint16_t filltime = millis() - m_t0;
    AUDIO_INFO("stream ready\nbuffer filled in %d ms", filltime);
  }

  if (!f_stream)
    return;

  // we have a webfile, read the file header first - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (m_controlCounter != 100) {
    InBuff.bytesWasRead(readAudioHeader(availableBytes));
    return;
  }

  // end of webfile reached? - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (f_webFileDataComplete &&
      InBuff.bufferFilled() < InBuff.getMaxBlockSize()) {
    if (InBuff.bufferFilled()) {
      if (!readID3V1Tag()) {
        int bytesDecoded =
            sendBytes(InBuff.getReadPtr(), InBuff.bufferFilled());
        if (bytesDecoded > 2) {
          InBuff.bytesWasRead(bytesDecoded);
          return;
        }
      }
    }
    playI2Sremains();
    stopSong(); // Correct close when play known length sound #74 and before
                // callback #11
    if (m_f_tts) {
      AUDIO_INFO("End of speech: \"%s\"", m_lastHost);
      if (audio_eof_speech)
        audio_eof_speech(m_lastHost);
    } else {
      AUDIO_INFO("End of webstream: \"%s\"", m_lastHost);
      if (audio_eof_stream)
        audio_eof_stream(m_lastHost);
    }
    return;
  }

  if (byteCounter == m_contentlength) {
    f_webFileDataComplete = true;
  }
  if (byteCounter - m_audioDataStart == m_audioDataSize) {
    f_webFileDataComplete = true;
  }

  // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (f_stream) {
    static uint8_t cnt = 0;
    uint8_t compression;
    if (m_codec == CODEC_WAV)
      compression = 1;
    if (m_codec == CODEC_FLAC)
      compression = 2;
    else
      compression = 6;
    cnt++;
    if (cnt == compression) {
      playAudioData();
      cnt = 0;
    }
  }
  return;
}
#endif // AUDIO_NO_NETWORK
//---------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
void Audio::processWebStreamTS() {

  const uint16_t maxFrameSize =
      InBuff.getMaxBlockSize(); // every mp3/aac frame is not bigger
  uint32_t availableBytes;      // available bytes in stream
  static bool f_tmr_1s;
  static bool f_stream; // first audio data received
  static bool f_firstPacket;
  static uint32_t byteCounter;   // count received data
  static uint32_t tmr_1s;        // timer 1 sec
  static uint32_t loopCnt;       // count loops if clientbuffer is empty
  static uint8_t ts_packet[188]; // m3u8 transport stream is 188 bytes long
  uint8_t ts_packetStart = 0;
  uint8_t ts_packetLength = 0;
  static uint8_t ts_packetPtr = 0;
  const uint8_t ts_packetsize = 188;
  static size_t chunkSize = 0;

  // first call, set some values to default - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (m_f_firstCall) { // runs only ont time per connection, prepare for start
    f_stream = false;
    f_firstPacket = true;
    byteCounter = 0;
    chunkSize = 0;
    loopCnt = 0;
    tmr_1s = millis();
    m_t0 = millis();
    ts_packetPtr = 0;
    m_controlCounter = 0;
    m_f_firstCall = false;
  }

