vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  if (getDatamode() != AUDIO_DATA)
    return; // guard

  if (InBuff.freeSpace() < maxFrameSize && f_stream) {
    playAudioData();
    return;
  }

  availableBytes = _client->available();
  if (availableBytes) {
    uint8_t readedBytes = 0;
    if (m_f_chunked)
      chunkSize = chunkedDataTransfer(&readedBytes);
    int res =
        _client->read(ts_packet + ts_packetPtr, ts_packetsize - ts_packetPtr);
    if (res > 0) {
      ts_packetPtr += res;
      byteCounter += res;
      if (ts_packetPtr < ts_packetsize)
        return;
      ts_packetPtr = 0;
      if (f_firstPacket) { // search for ID3 Header in the first packet
        f_firstPacket = false;
        uint8_t ID3_HeaderSize = process_m3u8_ID3_Header(ts_packet);
        if (ID3_HeaderSize > ts_packetsize) {
          log_e("ID3 Header is too big");
          stopSong();
          return;
        }
        if (ID3_HeaderSize) {
          memcpy(ts_packet, &ts_packet[ID3_HeaderSize],
                 ts_packetsize - ID3_HeaderSize);
          ts_packetPtr = ts_packetsize - ID3_HeaderSize;
          return;
        }
      }
      ts_parsePacket(&ts_packet[0], &ts_packetStart, &ts_packetLength);

      if (ts_packetLength) {
        size_t ws = InBuff.writeSpace();
        if (ws >= ts_packetLength) {
          memcpy(InBuff.getWritePtr(), ts_packet + ts_packetStart,
                 ts_packetLength);
          InBuff.bytesWritten(ts_packetLength);
        } else {
          memcpy(InBuff.getWritePtr(), ts_packet + ts_packetStart, ws);
          InBuff.bytesWritten(ws);
          memcpy(InBuff.getWritePtr(), &ts_packet[ws + ts_packetStart],
                 ts_packetLength - ws);
          InBuff.bytesWritten(ts_packetLength - ws);
        }
      }
      if (byteCounter == m_contentlength || byteCounter == chunkSize) {
        byteCounter = 0;
        m_f_continue = true;
      }
      if (byteCounter > m_contentlength)
        log_e("byteCounter overflow");
    }
  }

  // timer, triggers every second - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if ((tmr_1s + 1000) < millis()) {
    f_tmr_1s = true; // flag will be set every second for one loop only
    tmr_1s = millis();
  }

  // if the buffer is often almost empty issue a warning  - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (InBuff.bufferFilled() < maxFrameSize && f_stream) {
    static uint8_t cnt_slow = 0;
    cnt_slow++;
    if (f_tmr_1s) {
      if (cnt_slow > 50 && audio_info)
        audio_info("slow stream, dropouts are possible");
      f_tmr_1s = false;
      cnt_slow = 0;
    }
  }

  // if the buffer can't filled for several seconds try a new connection  - - -
  // - - - - - - - - - - - - - - - - - - -
  if (f_stream && !availableBytes) {
    loopCnt++;
    if (loopCnt > 200000) { // wait several seconds
      loopCnt = 0;
      AUDIO_INFO("Stream lost -> try new connection");
      httpPrint(m_lastHost);
      return;
    }
  }
  if (availableBytes)
    loopCnt = 0;

  // buffer fill routine  - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (true) { // statement has no effect
    if (InBuff.bufferFilled() > maxFrameSize &&
        !f_stream) {   // waiting for buffer filled
      f_stream = true; // ready to play the audio data
      uint16_t filltime = millis() - m_t0;
      if (m_f_Log)
        AUDIO_INFO("stream ready");
      if (m_f_Log)
        AUDIO_INFO("buffer filled in %d ms", filltime);
    }
    if (!f_stream)
      return;
  }

  // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (f_stream) {
    static uint8_t cnt = 0;
    cnt++;
    if (cnt == 6) {
      playAudioData();
      cnt = 0;
    }
  }
  return;
}
#endif // AUDIO_NO_NETWORK
//---------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
void Audio::processWebStreamHLS() {

  const uint16_t maxFrameSize =
      InBuff.getMaxBlockSize(); // every mp3/aac frame is not bigger
  const uint16_t ID3BuffSize = 1024;
  uint32_t availableBytes; // available bytes in stream
  static bool f_tmr_1s;
  static bool f_stream; // first audio data received
  static bool firstBytes;
  static uint32_t byteCounter; // count received data
  static size_t chunkSize = 0;
  static uint32_t tmr_1s;  // timer 1 sec
  static uint32_t loopCnt; // count loops if clientbuffer is empty
  static uint16_t ID3WritePtr;
  static uint16_t ID3ReadPtr;
  static uint8_t *ID3Buff;

  // first call, set some values to default - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (m_f_firstCall) { // runs only ont time per connection, prepare for start
    f_stream = false;
    byteCounter = 0;
    chunkSize = 0;
    loopCnt = 0;
    ID3WritePtr = 0;
    ID3ReadPtr = 0;
    tmr_1s = millis();
    m_t0 = millis();
    m_f_firstCall = false;
    firstBytes = true;
    ID3Buff = (uint8_t *)malloc(ID3BuffSize);
    m_controlCounter = 0;
  }

  if (getDatamode() != AUDIO_DATA)
    return; // guard

  availableBytes = _client->available();
  if (availableBytes) { // an ID3 header could come here
    uint8_t readedBytes = 0;

    if (m_f_chunked && !chunkSize) {
      chunkSize = chunkedDataTransfer(&readedBytes);
      byteCounter += readedBytes;
    }

    if (firstBytes) {
      if (ID3WritePtr < ID3BuffSize) {
        ID3WritePtr += _client->readBytes(&ID3Buff[ID3WritePtr],
                                          ID3BuffSize - ID3WritePtr);
        return;
      }
      if (m_controlCounter < 100) {
        int res =
            read_ID3_Header(&ID3Buff[ID3ReadPtr], ID3BuffSize - ID3ReadPtr);
        if (res >= 0)
          ID3ReadPtr += res;
        if (ID3ReadPtr > ID3BuffSize) {
          log_e("buffer overflow");
          stopSong();
          return;
        }
        return;
      }
      if (m_controlCounter != 100)
        return;

      size_t ws = InBuff.writeSpace();
      if (ws >= ID3BuffSize - ID3ReadPtr) {
        memcpy(InBuff.getWritePtr(), &ID3Buff[ID3ReadPtr],
               ID3BuffSize - ID3ReadPtr);
        InBuff.bytesWritten(ID3BuffSize - ID3ReadPtr);
      } else {
        memcpy(InBuff.getWritePtr(), &ID3Buff[ID3ReadPtr], ws);
        InBuff.bytesWritten(ws);
        memcpy(InBuff.getWritePtr(), &ID3Buff[ws + ID3ReadPtr],
               ID3BuffSize - (ID3ReadPtr + ws));
        InBuff.bytesWritten(ID3BuffSize - (ID3ReadPtr + ws));
      }
      if (ID3Buff)
        free(ID3Buff);
      byteCounter += ID3BuffSize;
      ID3Buff = NULL;
      firstBytes = false;
    }

    size_t bytesWasWritten = 0;
    if (InBuff.writeSpace() >= availableBytes) {
      bytesWasWritten = _client->read(InBuff.getWritePtr(), availableBytes);
    } else {
      bytesWasWritten =
          _client->read(InBuff.getWritePtr(), InBuff.writeSpace());
    }
    InBuff.bytesWritten(bytesWasWritten);

    byteCounter += bytesWasWritten;
    if (byteCounter == m_contentlength || byteCounter == chunkSize) {
      byteCounter = 0;
      m_f_continue = true;
    }
  }

  // timer, triggers every second - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if ((tmr_1s + 1000) < millis()) {
    f_tmr_1s = true; // flag will be set every second for one loop only
    tmr_1s = millis();
  }

  // if the buffer is often almost empty issue a warning  - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (InBuff.bufferFilled() < maxFrameSize && f_stream) {
    static uint8_t cnt_slow = 0;
    cnt_slow++;
    if (f_tmr_1s) {
      if (cnt_slow > 25 && audio_info)
        audio_info("slow stream, dropouts are possible");
      f_tmr_1s = false;
      cnt_slow = 0;
    }
  }

  // if the buffer can't filled for several seconds try a new connection  - - -
  // - - - - - - - - - - - - - - - - - - -
  if (f_stream && !availableBytes) {
    loopCnt++;
    if (loopCnt > 200000) { // wait several seconds
      loopCnt = 0;
      AUDIO_INFO("Stream lost -> try new connection");
      httpPrint(m_lastHost);
      return;
    }
  }
  if (availableBytes)
    loopCnt = 0;

  if (InBuff.bufferFilled() > maxFrameSize &&
      !f_stream) {   // waiting for buffer filled
    f_stream = true; // ready to play the audio data
    uint16_t filltime = millis() - m_t0;
    if (m_f_Log)
      AUDIO_INFO("stream ready");
    if (m_f_Log)
      AUDIO_INFO("buffer filled in %d ms", filltime);
  }

  // play audio data - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (f_stream) {
    static uint8_t cnt = 0;
    cnt++;
    if (cnt == 1) {
      playAudioData();
      cnt = 0;
    }
  }
  return;
}
#endif // AUDIO_NO_NETWORK
//---------------------------------------------------------------------------------------------------------------------
void Audio::playAudioData() {

  if (InBuff.bufferFilled() < InBuff.getMaxBlockSize())
    return; // guard

