vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  int bytesDecoded = sendBytes(InBuff.getReadPtr(), InBuff.getMaxBlockSize());

  if (bytesDecoded < 0) { // no syncword found or decode error, try next chunk
    log_i("err bytesDecoded %i", bytesDecoded);
    uint8_t next = 200;
    if (InBuff.bufferFilled() < next)
      next = InBuff.bufferFilled();
    InBuff.bytesWasRead(next); // try next chunk
#ifndef AUDIO_NO_NETWORK
    m_bytesNotDecoded += next;
#endif
  } else {
    if (bytesDecoded > 0) {
      InBuff.bytesWasRead(bytesDecoded);
      return;
    }
    if (bytesDecoded == 0)
      return; // syncword at pos0 found
  }

  return;
}
//---------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
bool Audio::parseHttpResponseHeader() { // this is the response to a GET /
                                        // request

  if (getDatamode() != HTTP_RESPONSE_HEADER)
    return false;
  if (_client->available() == 0)
    return false;

  char rhl[512]; // responseHeaderline
  bool ct_seen = false;
  uint32_t ctime = millis();
  uint32_t timeout = 2500; // ms

  while (true) { // outer while
    uint16_t pos = 0;
    if ((millis() - ctime) > timeout) {
      log_e("timeout");
      goto exit;
    }
    while (_client->available()) {
      uint8_t b = _client->read();
      if (b == '\n') {
        if (!pos) { // empty line received, is the last line of this
                    // responseHeader
          if (ct_seen)
            goto lastToDo;
          else
            goto exit;
        }
        break;
      }
      if (b == '\r')
        rhl[pos] = 0;
      if (b < 0x20)
        continue;
      rhl[pos] = b;
      pos++;
      if (pos == 511) {
        pos = 510;
        continue;
      }
      if (pos == 510) {
        rhl[pos] = '\0';
        if (m_f_Log)
          log_i("responseHeaderline overflow");
      }
    } // inner while

    if (!pos) {
      vTaskDelay(3);
      continue;
    }

    if (m_f_Log) {
      log_i("httpResponseHeader: %s", rhl);
    }

    int16_t posColon =
        indexOf(rhl, ":", 0); // lowercase all letters up to the colon
    if (posColon >= 0) {
      for (int i = 0; i < posColon; i++) {
        rhl[i] = toLowerCase(rhl[i]);
      }
    }

    if (startsWith(rhl, "HTTP/")) { // HTTP status error code
      char statusCode[5];
      statusCode[0] = rhl[9];
      statusCode[1] = rhl[10];
      statusCode[2] = rhl[11];
      statusCode[3] = '\0';
      int sc = atoi(statusCode);
      if (sc > 310) { // e.g. HTTP/1.1 301 Moved Permanently
        if (audio_showstreamtitle)
          audio_showstreamtitle(rhl);
        goto exit;
      }
    }

    else if (startsWith(
                 rhl,
                 "content-type:")) { // content-type: text/html; charset=UTF-8
      int idx = indexOf(rhl + 13, ";");
      if (idx > 0)
        rhl[13 + idx] = '\0';
      if (parseContentType(rhl + 13))
        ct_seen = true;
      else
        goto exit;
    }

    else if (startsWith(rhl, "location:")) {
      int pos = indexOf(rhl, "http", 0);
      if (pos >= 0) {
        const char *c_host = (rhl + pos);
        if (strcmp(c_host, m_lastHost) != 0) { // prevent a loop
          int pos_slash = indexOf(c_host, "/", 9);
          if (pos_slash > 9) {
            if (!strncmp(c_host, m_lastHost, pos_slash)) {
              AUDIO_INFO("redirect to new extension at existing host \"%s\"",
                         c_host);
              if (m_playlistFormat == FORMAT_M3U8) {
                strcpy(m_lastHost, c_host);
                m_f_m3u8data = true;
              }
              httpPrint(c_host);
              while (_client->available())
                _client->read(); // empty client buffer
              return true;
            }
          }
          AUDIO_INFO("redirect to new host \"%s\"", c_host);
          connecttohost(c_host);
          return true;
        }
      }
    }

    else if (startsWith(rhl, "content-encoding:")) {
      if (indexOf(rhl, "gzip")) {
        AUDIO_INFO("can't extract gzip");
        goto exit;
      }
    }

    else if (startsWith(rhl, "content-disposition:")) {
      int pos1, pos2; // pos3;
      // e.g we have this headerline:  content-disposition: attachment;
      // filename=stream.asx filename is: "stream.asx"
      pos1 = indexOf(rhl, "filename=", 0);
      if (pos1 > 0) {
        pos1 += 9;
        if (rhl[pos1] == '\"')
          pos1++; // remove '\"' around filename if present
        pos2 = strlen(rhl);
        if (rhl[pos2 - 1] == '\"')
          rhl[pos2 - 1] = '\0';
      }
      AUDIO_INFO("Filename is %s", rhl + pos1);
    }

    // if(startsWith(rhl, "set-cookie:")         ||
    //         startsWith(rhl, "pragma:")        ||
    //         startsWith(rhl, "expires:")       ||
    //         startsWith(rhl, "cache-control:") ||
    //         startsWith(rhl, "icy-pub:")       ||
    //         startsWith(rhl, "p3p:")           ||
    //         startsWith(rhl, "accept-ranges:") ){
    //     ; // do nothing
    // }

    else if (startsWith(rhl, "connection:")) {
      if (indexOf(rhl, "close", 0) >= 0) {
        ; /* do nothing */
      }
    }

    else if (startsWith(rhl, "icy-genre:")) {
      ; // do nothing Ambient, Rock, etc
    }

    else if (startsWith(rhl, "icy-br:")) {
      const char *c_bitRate = (rhl + 7);
      int32_t br =
          atoi(c_bitRate); // Found bitrate tag, read the bitrate in Kbit
      br = br * 1000;
      setBitrate(br);
      sprintf(m_chbuf, "%d", getBitRate());
      if (audio_bitrate)
        audio_bitrate(m_chbuf);
    }

    else if (startsWith(rhl, "icy-metaint:")) {
      const char *c_metaint = (rhl + 12);
      int32_t i_metaint = atoi(c_metaint);
      m_metaint = i_metaint;
      if (m_metaint)
        m_f_metadata = true; // Multimediastream
    }

    else if (startsWith(rhl, "icy-name:")) {
      char *c_icyname = (rhl + 9); // Get station name
      trim(c_icyname);
      if (strlen(c_icyname) > 0) {
        if (!m_f_Log)
          AUDIO_INFO("icy-name: %s", c_icyname);
        if (audio_showstation)
          audio_showstation(c_icyname);
      }
    }

    else if (startsWith(rhl, "content-length:")) {
      const char *c_cl = (rhl + 15);
      int32_t i_cl = atoi(c_cl);
      m_contentlength = i_cl;
      m_streamType = ST_WEBFILE; // Stream comes from a fileserver
      if (m_f_Log)
        AUDIO_INFO("content-length: %i", m_contentlength);
    }

    else if (startsWith(rhl, "icy-description:")) {
      const char *c_idesc = (rhl + 16);
      while (c_idesc[0] == ' ')
        c_idesc++;
      latinToUTF8(
          rhl,
          sizeof(
              rhl)); // if already UTF-0 do nothing, otherwise convert to UTF-8
      if (audio_icydescription)
        audio_icydescription(c_idesc);
    }

    else if ((startsWith(rhl, "transfer-encoding:"))) {
      if (endsWith(rhl, "chunked") ||
          endsWith(rhl, "Chunked")) { // Station provides chunked transfer
        m_f_chunked = true;
        if (!m_f_Log)
          AUDIO_INFO("chunked data transfer");
        m_chunkcount = 0; // Expect chunkcount in DATA
      }
    }

    else if (startsWith(rhl, "icy-url:")) {
      char *icyurl = (rhl + 8);
      trim(icyurl);
      if (audio_icyurl)
        audio_icyurl(icyurl);
    }

    else if (startsWith(rhl, "www-authenticate:")) {
      AUDIO_INFO("authentification failed, wrong credentials?");
      goto exit;
    } else {
      ;
    }
  } // outer while

exit: // termination condition
  if (audio_showstation)
    audio_showstation("");
  if (audio_icydescription)
    audio_icydescription("");
  if (audio_icyurl)
    audio_icyurl("");
  m_lastHost[0] = '\0';
  setDatamode(AUDIO_NONE);
  stopSong();
  return false;

lastToDo:
  if (m_codec != CODEC_NONE) {
    setDatamode(AUDIO_DATA); // Expecting data now
    if (!initializeDecoder())
      return false;
    if (m_f_Log) {
      log_i("Switch to DATA, metaint is %d", m_metaint);
    }
    if (m_playlistFormat != FORMAT_M3U8 && audio_lasthost)
      audio_lasthost(m_lastHost);
    m_controlCounter = 0;
    m_f_firstCall = true;
  } else if (m_playlistFormat != FORMAT_NONE) {
    setDatamode(AUDIO_PLAYLISTINIT); // playlist expected
    if (m_f_Log) {
      log_i("now parse playlist");
    }
  } else {
    AUDIO_INFO("unknown content found at: %s", m_lastHost);
    goto exit;
  }
  return true;
}
#endif // AUDIO_NO_NETWORK
//---------------------------------------------------------------------------------------------------------------------
bool Audio::initializeDecoder() {
  switch (m_codec) {
  case CODEC_MP3:
    if (!MP3Decoder_AllocateBuffers())
      goto exit;
    AUDIO_INFO("MP3Decoder has been initialized, free Heap: %u bytes",
               ESP.getFreeHeap());
    InBuff.changeMaxBlockSize(m_frameSizeMP3);
    break;
  case CODEC_AAC:
    if (!AACDecoder_IsInit()) {
      if (!AACDecoder_AllocateBuffers())
        goto exit;
      AUDIO_INFO("AACDecoder has been initialized, free Heap: %u bytes",
                 ESP.getFreeHeap());
      InBuff.changeMaxBlockSize(m_frameSizeAAC);
    }
    break;
  case CODEC_M4A:
    if (!AACDecoder_IsInit()) {
      if (!AACDecoder_AllocateBuffers())
        goto exit;
      AUDIO_INFO("AACDecoder has been initialized, free Heap: %u bytes",
                 ESP.getFreeHeap());
      InBuff.changeMaxBlockSize(m_frameSizeAAC);
    }
    break;
  case CODEC_FLAC:
    if (!psramFound()) {
      AUDIO_INFO("FLAC works only with PSRAM!");
      goto exit;
    }
    if (!FLACDecoder_AllocateBuffers())
      goto exit;
    InBuff.changeMaxBlockSize(m_frameSizeFLAC);
    AUDIO_INFO("FLACDecoder has been initialized, free Heap: %u bytes",
               ESP.getFreeHeap());
    break;
  case CODEC_WAV:
    InBuff.changeMaxBlockSize(m_frameSizeWav);
    break;
  case CODEC_OGG:
    m_codec = CODEC_OGG;
    AUDIO_INFO("ogg not supported");
    goto exit;
    break;
  default:
    goto exit;
    break;
  }
  return true;

