vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
exit:
  stopSong();
  return false;
}
//---------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
bool Audio::parseContentType(char *ct) {

  enum : int {
    CT_NONE,
    CT_MP3,
    CT_AAC,
    CT_M4A,
    CT_WAV,
    CT_OGG,
    CT_FLAC,
    CT_PLS,
    CT_M3U,
    CT_ASX,
    CT_M3U8,
    CT_TXT,
    CT_AACP
  };

  strlwr(ct);
  trim(ct);

  m_codec = CODEC_NONE;
  int ct_val = CT_NONE;

  if (!strcmp(ct, "audio/mpeg"))
    ct_val = CT_MP3;
  else if (!strcmp(ct, "audio/mpeg3"))
    ct_val = CT_MP3;
  else if (!strcmp(ct, "audio/x-mpeg"))
    ct_val = CT_MP3;
  else if (!strcmp(ct, "audio/x-mpeg-3"))
    ct_val = CT_MP3;
  else if (!strcmp(ct, "audio/mp3"))
    ct_val = CT_MP3;

  else if (!strcmp(ct, "audio/aac"))
    ct_val = CT_AAC;
  else if (!strcmp(ct, "audio/x-aac"))
    ct_val = CT_AAC;
  else if (!strcmp(ct, "audio/aacp")) {
    ct_val = CT_AAC;
    if (m_playlistFormat == FORMAT_M3U8)
      m_f_ts = true;
  } else if (!strcmp(ct, "video/mp2t")) {
    ct_val = CT_AAC;
    m_f_ts = true;
  } // assume AAC transport stream
  else if (!strcmp(ct, "audio/mp4"))
    ct_val = CT_M4A;
  else if (!strcmp(ct, "audio/m4a"))
    ct_val = CT_M4A;
  else if (!strcmp(ct, "audio/x-m4a"))
    ct_val = CT_M4A;

  else if (!strcmp(ct, "audio/wav"))
    ct_val = CT_WAV;
  else if (!strcmp(ct, "audio/x-wav"))
    ct_val = CT_WAV;

  else if (!strcmp(ct, "audio/flac"))
    ct_val = CT_FLAC;

  else if (!strcmp(ct, "audio/scpls"))
    ct_val = CT_PLS;
  else if (!strcmp(ct, "audio/x-scpls"))
    ct_val = CT_PLS;
  else if (!strcmp(ct, "application/pls+xml"))
    ct_val = CT_PLS;
  else if (!strcmp(ct, "audio/mpegurl")) {
    ct_val = CT_M3U;
    if (m_expectedPlsFmt == FORMAT_M3U8)
      ct_val = CT_M3U8;
  } else if (!strcmp(ct, "audio/x-mpegurl"))
    ct_val = CT_M3U;
  else if (!strcmp(ct, "audio/ms-asf"))
    ct_val = CT_ASX;
  else if (!strcmp(ct, "video/x-ms-asf"))
    ct_val = CT_ASX;
  else if (!strcmp(ct, "audio/x-ms-asx"))
    ct_val = CT_ASX; // #413

  else if (!strcmp(ct, "application/ogg"))
    ct_val = CT_OGG;
  else if (!strcmp(ct, "application/vnd.apple.mpegurl"))
    ct_val = CT_M3U8;
  else if (!strcmp(ct, "application/x-mpegurl"))
    ct_val = CT_M3U8;

  else if (!strcmp(ct, "application/octet-stream"))
    ct_val = CT_TXT; // ??? listen.radionomy.com/1oldies before redirection
  else if (!strcmp(ct, "text/html"))
    ct_val = CT_TXT;
  else if (!strcmp(ct, "text/plain"))
    ct_val = CT_TXT;

  else if (ct_val == CT_NONE) {
    AUDIO_INFO("ContentType %s not supported", ct);
    return false; // nothing valid had been seen
  } else {
    ;
  }

  switch (ct_val) {
  case CT_MP3:
    m_codec = CODEC_MP3;
    if (m_f_Log) {
      log_i("ContentType %s, format is mp3", ct);
    } // ok is likely mp3
    break;
  case CT_AAC:
    m_codec = CODEC_AAC;
    if (m_f_Log) {
      log_i("ContentType %s, format is aac", ct);
    }
    break;
  case CT_M4A:
    m_codec = CODEC_M4A;
    if (m_f_Log) {
      log_i("ContentType %s, format is aac", ct);
    }
    break;
  case CT_FLAC:
    m_codec = CODEC_FLAC;
    if (m_f_Log) {
      log_i("ContentType %s, format is flac", ct);
    }
    break;
  case CT_WAV:
    m_codec = CODEC_WAV;
    if (m_f_Log) {
      log_i("ContentType %s, format is wav", ct);
    }
    break;
  case CT_OGG:
    m_codec = CODEC_OGG;
    if (m_f_Log) {
      log_i("ContentType %s found", ct);
    }
    break;

  case CT_PLS:
    m_playlistFormat = FORMAT_PLS;
    break;
  case CT_M3U:
    m_playlistFormat = FORMAT_M3U;
    break;
  case CT_ASX:
    m_playlistFormat = FORMAT_ASX;
    break;
  case CT_M3U8:
    m_playlistFormat = FORMAT_M3U8;
    break;
  case CT_TXT: // overwrite text/plain
    if (m_expectedCodec == CODEC_AAC) {
      m_codec = CODEC_AAC;
      if (m_f_Log)
        log_i("set ct from M3U8 to AAC");
    }
    if (m_expectedCodec == CODEC_MP3) {
      m_codec = CODEC_MP3;
      if (m_f_Log)
        log_i("set ct from M3U8 to MP3");
    }

    if (m_expectedPlsFmt == FORMAT_ASX) {
      m_playlistFormat = FORMAT_ASX;
      if (m_f_Log)
        log_i("set playlist format to ASX");
    }
    if (m_expectedPlsFmt == FORMAT_M3U) {
      m_playlistFormat = FORMAT_M3U;
      if (m_f_Log)
        log_i("set playlist format to M3U");
    }
    if (m_expectedPlsFmt == FORMAT_M3U8) {
      m_playlistFormat = FORMAT_M3U8;
      if (m_f_Log)
        log_i("set playlist format to M3U8");
    }
    if (m_expectedPlsFmt == FORMAT_PLS) {
      m_playlistFormat = FORMAT_PLS;
      if (m_f_Log)
        log_i("set playlist format to PLS");
    }
    break;
  default:
    AUDIO_INFO("%s, unsupported audio format", ct);
    return false;
    break;
  }
  return true;
}
#endif // AUDIO_NO_NETWORK
//---------------------------------------------------------------------------------------------------------------------
void Audio::showstreamtitle(const char *ml) {
  // example for ml:
  // StreamTitle='Oliver Frank - Mega
  // Hitmix';StreamUrl='www.radio-welle-woerthersee.at'; or
  // adw_ad='true';durationMilliseconds='10135';adId='34254';insertionType='preroll';

  int16_t idx1, idx2, idx4, idx5, idx6, idx7, titleLen = 0, artistLen = 0;
  uint16_t i = 0, hash = 0;

  idx1 = indexOf(ml, "StreamTitle=", 0); // Streamtitle found
  if (idx1 >= 0) {
    if (indexOf(ml, "xml version=", 12) > 0) {

      /* e.g. xmlStreamTitle
      StreamTitle='<?xml version="1.0"
      encoding="utf-8"?><RadioInfo><Table><DB_ALBUM_ID>37364</DB_ALBUM_ID>
      <DB_ALBUM_IMAGE>00000037364.jpg</DB_ALBUM_IMAGE><DB_ALBUM_NAME>Boyfriend</DB_ALBUM_NAME>
      <DB_ALBUM_TYPE>Single</DB_ALBUM_TYPE><DB_DALET_ARTIST_NAME>DOVE
      CAMERON</DB_DALET_ARTIST_NAME>
      <DB_DALET_ITEM_CODE>CD4161</DB_DALET_ITEM_CODE><DB_DALET_TITLE_NAME>BOYFRIEND</DB_DALET_TITLE_NAME>
      <DB_FK_SITE_ID>2</DB_FK_SITE_ID><DB_IS_MUSIC>1</DB_IS_MUSIC><DB_LEAD_ARTIST_ID>26303</DB_LEAD_ARTIST_ID>
      <DB_LEAD_ARTIST_NAME>Dove
      Cameron</DB_LEAD_ARTIST_NAME><DB_RADIO_IMAGE>cidadefm.jpg</DB_RADIO_IMAGE>
      <DB_RADIO_NAME>Cidade</DB_RADIO_NAME><DB_SONG_ID>120126</DB_SONG_ID><DB_SONG_LYRIC>60981</DB_SONG_LYRIC>
      <DB_SONG_NAME>Boyfriend</DB_SONG_NAME></Table><AnimadorInfo><TITLE>Cidade</TITLE>
      <START_TIME_UTC>2022-11-15T22:00:00+00:00</START_TIME_UTC><END_TIME_UTC>2022-11-16T06:59:59+00:00
      </END_TIME_UTC><SHOW_NAME>Cidade</SHOW_NAME><SHOW_HOURS>22h às
      07h</SHOW_HOURS><SHOW_PANEL>0</SHOW_PANEL>
      </AnimadorInfo></RadioInfo>';StreamUrl='';
      */

      idx4 = indexOf(ml, "<DB_DALET_TITLE_NAME>");
      idx5 = indexOf(ml, "</DB_DALET_TITLE_NAME>");

