vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
      idx6 = indexOf(ml, "<DB_LEAD_ARTIST_NAME>");
      idx7 = indexOf(ml, "</DB_LEAD_ARTIST_NAME>");

      if (idx4 == -1 || idx5 == -1)
        return;
      idx4 += 21; // <DB_DALET_TITLE_NAME>
      titleLen = idx5 - idx4;

      if (idx6 != -1 && idx7 != -1) {
        idx6 += 21; // <DB_LEAD_ARTIST_NAME>
        artistLen = idx7 - idx6;
      }

      char *title = NULL;
      title = (char *)malloc(titleLen + artistLen + 4);
      memcpy(title, ml + idx4, titleLen);
      title[titleLen] = '\0';

      char *artist = NULL;
      if (artistLen) {
        memcpy(title + titleLen, " - ", 3);
        memcpy(title + titleLen + 3, ml + idx6, artistLen);
        title[titleLen + 3 + artistLen] = '\0';
      }

      if (title)
        if (audio_showstreamtitle)
          audio_showstreamtitle(title);
      if (title) {
        free(title);
        title = NULL;
      }
      if (artist) {
        free(artist);
        artist = NULL;
      }
      return;
    }

    idx2 = indexOf(ml, ";", idx1);
    char *sTit;
    if (idx2 >= 0) {
      sTit = strndup(ml + idx1, idx2 + 1);
      sTit[idx2] = '\0';
    } else
      sTit = strdup(ml);

    while (i < strlen(sTit)) {
      hash += sTit[i] * i + 1;
      i++;
    }

#ifndef AUDIO_NO_NETWORK
    if (m_streamTitleHash != hash) {
      m_streamTitleHash = hash;
#else
    {
#endif
      AUDIO_INFO("%s", sTit);
      uint8_t pos = 12; // remove "StreamTitle="
      if (sTit[pos] == '\'')
        pos++; // remove leading  \'
      if (sTit[strlen(sTit) - 1] == '\'')
        sTit[strlen(sTit) - 1] = '\0'; // remove trailing \'
      if (audio_showstreamtitle)
        audio_showstreamtitle(sTit + pos);
    }
    if (sTit) {
      free(sTit);
      sTit = NULL;
    }
  }

#ifndef AUDIO_NO_NETWORK
  idx1 = indexOf(ml, "StreamUrl=", 0);
  idx2 = indexOf(ml, ";", idx1);
  if (idx1 >= 0 && idx2 > idx1) { // StreamURL found
    uint16_t len = idx2 - idx1;
    char *sUrl;
    sUrl = strndup(ml + idx1, len + 1);
    sUrl[len] = '\0';

    while (i < strlen(sUrl)) {
      hash += sUrl[i] * i + 1;
      i++;
    }
    if (m_streamTitleHash != hash) {
      m_streamTitleHash = hash;
      AUDIO_INFO("%s", sUrl);
    }
    if (sUrl) {
      free(sUrl);
      sUrl = NULL;
    }
  }
#endif

#ifndef AUDIO_NO_NETWORK
  idx1 = indexOf(ml, "adw_ad=", 0);
  if (idx1 >= 0) { // Advertisement found
    idx1 = indexOf(ml, "durationMilliseconds=", 0);
    idx2 = indexOf(ml, ";", idx1);
    if (idx1 >= 0 && idx2 > idx1) {
      uint16_t len = idx2 - idx1;
      char *sAdv;
      sAdv = strndup(ml + idx1, len + 1);
      sAdv[len] = '\0';
      AUDIO_INFO("%s", sAdv);
      uint8_t pos = 21; // remove "StreamTitle="
      if (sAdv[pos] == '\'')
        pos++; // remove leading  \'
      if (sAdv[strlen(sAdv) - 1] == '\'')
        sAdv[strlen(sAdv) - 1] = '\0'; // remove trailing \'
      if (audio_commercial)
        audio_commercial(sAdv + pos);
      if (sAdv) {
        free(sAdv);
        sAdv = NULL;
      }
    }
  }
#endif
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::showCodecParams() {
  // print Codec Parameter (mp3, aac) in audio_info()

  AUDIO_INFO("Channels: %i", getChannels());
  AUDIO_INFO("SampleRate: %i", getSampleRate());
  AUDIO_INFO("BitsPerSample: %i", getBitsPerSample());
  if (getBitRate()) {
    AUDIO_INFO("BitRate: %i", getBitRate());
  } else {
    AUDIO_INFO("BitRate: N/A");
  }

  if (m_codec == CODEC_AAC || m_codec == CODEC_M4A) {
    uint8_t answ;
    if ((answ = AACGetFormat()) < 4) {
      const char hf[4][8] = {"unknown", "ADTS", "ADIF", "RAW"};
      sprintf(m_chbuf, "AAC HeaderFormat: %s", hf[answ]);
      audio_info(m_chbuf);
    }
    if (answ == 1) { // ADTS Header
      const char co[2][23] = {"MPEG-4", "MPEG-2"};
      sprintf(m_chbuf, "AAC Codec: %s", co[AACGetID()]);
      audio_info(m_chbuf);
      if (AACGetProfile() < 5) {
        const char pr[4][23] = {"Main", "LowComplexity",
                                "Scalable Sampling Rate", "reserved"};
        sprintf(m_chbuf, "AAC Profile: %s", pr[answ]);
        audio_info(m_chbuf);
      }
    }
  }
}
//---------------------------------------------------------------------------------------------------------------------
int Audio::findNextSync(uint8_t *data, size_t len) {
  // Mp3 and aac audio data are divided into frames. At the beginning of each
  // frame there is a sync word. The sync word is 0xFFF. This is followed by
  // information about the structure of the frame. Wav files have no frames
  // Return: 0 the synchronous word was found at position 0
  //         > 0 is the offset to the next sync word
  //         -1 the sync word was not found within the block with the length len

  int nextSync;
  static uint32_t swnf = 0;
  if (m_codec == CODEC_WAV) {
    m_f_playing = true;
    nextSync = 0;
  }
  if (m_codec == CODEC_MP3) {
    nextSync = MP3FindSyncWord(data, len);
  }
  if (m_codec == CODEC_AAC) {
    nextSync = AACFindSyncWord(data, len);
  }
  if (m_codec == CODEC_M4A) {
    AACSetRawBlockParams(0, 2, 44100, 1);
    m_f_playing = true;
    nextSync = 0;
  }
  if (m_codec == CODEC_FLAC) {
    FLACSetRawBlockParams(m_flacNumChannels, m_flacSampleRate,
                          m_flacBitsPerSample, m_flacTotalSamplesInStream,
                          m_audioDataSize);
    nextSync = FLACFindSyncWord(data, len);
  }
  if (m_codec == CODEC_OGG_FLAC) {
    FLACSetRawBlockParams(m_flacNumChannels, m_flacSampleRate,
                          m_flacBitsPerSample, m_flacTotalSamplesInStream,
                          m_audioDataSize);
    nextSync = FLACFindSyncWord(data, len);
  }
  if (nextSync == -1) {
    if (audio_info && swnf == 0)
      audio_info("syncword not found");
    if (m_codec == CODEC_OGG_FLAC) {
      nextSync = len;
    } else {
      swnf++; // syncword not found counter, can be multimediadata
    }
  }
  if (nextSync == 0) {
    if (audio_info && swnf > 0) {
      sprintf(m_chbuf, "syncword not found %i times", swnf);
      audio_info(m_chbuf);
      swnf = 0;
    } else {
      if (audio_info)
        audio_info("syncword found at pos 0");
    }
  }
  if (nextSync > 0) {
    AUDIO_INFO("syncword found at pos %i", nextSync);
  }
  return nextSync;
}
//---------------------------------------------------------------------------------------------------------------------
int Audio::sendBytes(uint8_t *data, size_t len) {
  int bytesLeft;
  static bool f_setDecodeParamsOnce = true;
  int nextSync = 0;
  if (!m_f_playing) {
    f_setDecodeParamsOnce = true;
    nextSync = findNextSync(data, len);
    if (nextSync == 0) {
      m_f_playing = true;
    }
    return nextSync;
  }
  // m_f_playing is true at this pos
  bytesLeft = len;
  int ret = 0;
  int bytesDecoded = 0;

