vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  switch (m_codec) {
  case CODEC_WAV:
    memmove(m_outBuff, data, len); // copy len data in outbuff and set
                                   // validsamples and bytesdecoded=len
    if (getBitsPerSample() == 16)
      m_validSamples = len / (2 * getChannels());
    if (getBitsPerSample() == 8)
      m_validSamples = len / 2;
    bytesLeft = 0;
    break;
  case CODEC_MP3:
    ret = MP3Decode(data, &bytesLeft, m_outBuff, 0);
    break;
  case CODEC_AAC:
    ret = AACDecode(data, &bytesLeft, m_outBuff);
    break;
  case CODEC_M4A:
    ret = AACDecode(data, &bytesLeft, m_outBuff);
    break;
  case CODEC_FLAC:
    ret = FLACDecode(data, &bytesLeft, m_outBuff);
    break;
  case CODEC_OGG_FLAC:
    ret = FLACDecode(data, &bytesLeft, m_outBuff);
    break; // FLAC webstream wrapped in OGG
  default: {
    log_e("no valid codec found codec = %d", m_codec);
    stopSong();
  }
  }

  bytesDecoded = len - bytesLeft;
  if (bytesDecoded == 0 && ret == 0) { // unlikely framesize
    if (audio_info)
      audio_info("framesize is 0, start decoding again");
    m_f_playing = false; // seek for new syncword
    // we're here because there was a wrong sync word
    // so skip two sync bytes and seek for next
    return 1;
  }
  if (ret < 0) { // Error, skip the frame...
    if (m_f_Log)
      if (m_codec == CODEC_M4A) {
        log_i("begin not found");
        return 1;
      }
    i2s_zero_dma_buffer((i2s_port_t)m_i2s_num);
    if (!getChannels() && (ret == -2)) {
      ; // suppress errorcode MAINDATA_UNDERFLOW
    } else {
      if (m_codec == CODEC_MP3 && ret == -2) {
        ;
      } // do nothing (suppress MAINDATA_UNDERFLOW)
      else {
        printDecodeError(ret);
        m_f_playing = false; // seek for new syncword
      }
    }
    if (!bytesDecoded)
      bytesDecoded = 2;
    return bytesDecoded;
  } else { // ret>=0
    if (f_setDecodeParamsOnce) {
      f_setDecodeParamsOnce = false;
      m_PlayingStartTime = millis();

      if (m_codec == CODEC_MP3) {
        setChannels(MP3GetChannels());
        setSampleRate(MP3GetSampRate());
        setBitsPerSample(MP3GetBitsPerSample());
        setBitrate(MP3GetBitrate());
      }
      if (m_codec == CODEC_AAC || m_codec == CODEC_M4A) {
        setChannels(AACGetChannels());
        setSampleRate(AACGetSampRate());
        setBitsPerSample(AACGetBitsPerSample());
        setBitrate(AACGetBitrate());
      }
      if (m_codec == CODEC_FLAC || m_codec == CODEC_OGG_FLAC) {
        setChannels(FLACGetChannels());
        setSampleRate(FLACGetSampRate());
        setBitsPerSample(FLACGetBitsPerSample());
        setBitrate(FLACGetBitRate());
      }
      showCodecParams();
    }
    if (m_codec == CODEC_MP3) {
      m_validSamples = MP3GetOutputSamps() / getChannels();
    }
    if ((m_codec == CODEC_AAC) || (m_codec == CODEC_M4A)) {
      m_validSamples = AACGetOutputSamps() / getChannels();
    }
    if ((m_codec == CODEC_FLAC) || (m_codec == CODEC_OGG_FLAC)) {
      m_validSamples = FLACGetOutputSamps() / getChannels();
    }
  }
  compute_audioCurrentTime(bytesDecoded);

  if (audio_process_extern) {
    bool continueI2S = false;
    audio_process_extern(m_outBuff, m_validSamples, &continueI2S);
    if (!continueI2S) {
      return bytesDecoded;
    }
  }
  while (m_validSamples) {
    playChunk();
  }
  return bytesDecoded;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::compute_audioCurrentTime(int bd) {
  static uint16_t loop_counter = 0;
  static int old_bitrate = 0;
  static uint64_t sum_bitrate = 0;
  static boolean f_CBR = true; // constant bitrate

  if (m_codec == CODEC_MP3) {
    setBitrate(MP3GetBitrate());
  } // if not CBR, bitrate can be changed
  if (m_codec == CODEC_M4A) {
    setBitrate(AACGetBitrate());
  } // if not CBR, bitrate can be changed
  if (m_codec == CODEC_AAC) {
    setBitrate(AACGetBitrate());
  } // if not CBR, bitrate can be changed
  if (m_codec == CODEC_FLAC) {
    setBitrate(FLACGetBitRate());
  } // if not CBR, bitrate can be changed
  if (!getBitRate())
    return;

  //- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  if (m_avr_bitrate == 0) { // first time
    loop_counter = 0;
    old_bitrate = 0;
    sum_bitrate = 0;
    f_CBR = true;
    m_avr_bitrate = getBitRate();
    old_bitrate = getBitRate();
  }
  if (!m_avr_bitrate)
    return;
  //- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

  if (loop_counter < 1000)
    loop_counter++;

  if ((old_bitrate != getBitRate()) && f_CBR) {
    if (audio_info)
      audio_info("VBR recognized, audioFileDuration is estimated");
    f_CBR = false; // variable bitrate
  }
  old_bitrate = getBitRate();

  if (!f_CBR) {
    if (loop_counter > 20 && loop_counter < 200) {
      // if VBR: m_avr_bitrate is average of the first values of m_bitrate
      sum_bitrate += getBitRate();
      m_avr_bitrate = sum_bitrate / (loop_counter - 20);
      if (loop_counter == 199 && m_resumeFilePos) {
        m_audioCurrentTime =
            ((getFilePos() - m_audioDataStart - inBufferFilled()) /
             m_avr_bitrate) *
            8; // #293
      }
    }
  } else {
    if (loop_counter == 2) {
      m_avr_bitrate = getBitRate();
      if (m_resumeFilePos) { // if connecttoFS() is called with resumeFilePos !=
                             // 0
        m_audioCurrentTime =
            ((getFilePos() - m_audioDataStart - inBufferFilled()) /
             m_avr_bitrate) *
            8; // #293
      }
    }
  }
  m_audioCurrentTime += ((float)bd / m_avr_bitrate) * 8;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::printDecodeError(int r) {
  const char *e;

  if (m_codec == CODEC_MP3) {
    switch (r) {
    case ERR_MP3_NONE:
      e = "NONE";
      break;
    case ERR_MP3_INDATA_UNDERFLOW:
      e = "INDATA_UNDERFLOW";
      break;
    case ERR_MP3_MAINDATA_UNDERFLOW:
      e = "MAINDATA_UNDERFLOW";
      break;
    case ERR_MP3_FREE_BITRATE_SYNC:
      e = "FREE_BITRATE_SYNC";
      break;
    case ERR_MP3_OUT_OF_MEMORY:
      e = "OUT_OF_MEMORY";
      break;
    case ERR_MP3_NULL_POINTER:
      e = "NULL_POINTER";
      break;
    case ERR_MP3_INVALID_FRAMEHEADER:
      e = "INVALID_FRAMEHEADER";
      break;
    case ERR_MP3_INVALID_SIDEINFO:
      e = "INVALID_SIDEINFO";
      break;
    case ERR_MP3_INVALID_SCALEFACT:
      e = "INVALID_SCALEFACT";
      break;
    case ERR_MP3_INVALID_HUFFCODES:
      e = "INVALID_HUFFCODES";
      break;
    case ERR_MP3_INVALID_DEQUANTIZE:
      e = "INVALID_DEQUANTIZE";
      break;
    case ERR_MP3_INVALID_IMDCT:
      e = "INVALID_IMDCT";
      break;
    case ERR_MP3_INVALID_SUBBAND:
      e = "INVALID_SUBBAND";
      break;
    default:
      e = "ERR_UNKNOWN";
    }
    AUDIO_INFO("MP3 decode error %d : %s", r, e);
  }
  if (m_codec == CODEC_AAC) {
    switch (r) {
    case ERR_AAC_NONE:
      e = "NONE";
      break;
    case ERR_AAC_INDATA_UNDERFLOW:
      e = "INDATA_UNDERFLOW";
      break;
    case ERR_AAC_NULL_POINTER:
      e = "NULL_POINTER";
      break;
    case ERR_AAC_INVALID_ADTS_HEADER:
      e = "INVALID_ADTS_HEADER";
      break;
    case ERR_AAC_INVALID_ADIF_HEADER:
      e = "INVALID_ADIF_HEADER";
      break;
    case ERR_AAC_INVALID_FRAME:
      e = "INVALID_FRAME";
      break;
    case ERR_AAC_MPEG4_UNSUPPORTED:
      e = "MPEG4_UNSUPPORTED";
      break;
    case ERR_AAC_CHANNEL_MAP:
      e = "CHANNEL_MAP";
      break;
    case ERR_AAC_SYNTAX_ELEMENT:
      e = "SYNTAX_ELEMENT";
      break;
    case ERR_AAC_DEQUANT:
      e = "DEQUANT";
      break;
    case ERR_AAC_STEREO_PROCESS:
      e = "STEREO_PROCESS";
      break;
    case ERR_AAC_PNS:
      e = "PNS";
      break;
    case ERR_AAC_SHORT_BLOCK_DEINT:
      e = "SHORT_BLOCK_DEINT";
      break;
    case ERR_AAC_TNS:
      e = "TNS";
      break;
    case ERR_AAC_IMDCT:
      e = "IMDCT";
      break;
    case ERR_AAC_SBR_INIT:
      e = "SBR_INIT";
      break;
    case ERR_AAC_SBR_BITSTREAM:
      e = "SBR_BITSTREAM";
      break;
    case ERR_AAC_SBR_DATA:
      e = "SBR_DATA";
      break;
    case ERR_AAC_SBR_PCM_FORMAT:
      e = "SBR_PCM_FORMAT";
      break;
    case ERR_AAC_SBR_NCHANS_TOO_HIGH:
      e = "SBR_NCHANS_TOO_HIGH";
      break;
    case ERR_AAC_SBR_SINGLERATE_UNSUPPORTED:
      e = "BR_SINGLERATE_UNSUPPORTED";
      break;
    case ERR_AAC_NCHANS_TOO_HIGH:
      e = "NCHANS_TOO_HIGH";
      break;
    case ERR_AAC_RAWBLOCK_PARAMS:
      e = "RAWBLOCK_PARAMS";
      break;
    default:
      e = "ERR_UNKNOWN";
    }
    AUDIO_INFO("AAC decode error %d : %s", r, e);
  }
  if (m_codec == CODEC_FLAC) {
    switch (r) {
    case ERR_FLAC_NONE:
      e = "NONE";
      break;
    case ERR_FLAC_BLOCKSIZE_TOO_BIG:
      e = "BLOCKSIZE TOO BIG";
      break;
    case ERR_FLAC_RESERVED_BLOCKSIZE_UNSUPPORTED:
      e = "Reserved Blocksize unsupported";
      break;
    case ERR_FLAC_SYNC_CODE_NOT_FOUND:
      e = "SYNC CODE NOT FOUND";
      break;
    case ERR_FLAC_UNKNOWN_CHANNEL_ASSIGNMENT:
      e = "UNKNOWN CHANNEL ASSIGNMENT";
      break;
    case ERR_FLAC_RESERVED_CHANNEL_ASSIGNMENT:
      e = "RESERVED CHANNEL ASSIGNMENT";
      break;
    case ERR_FLAC_RESERVED_SUB_TYPE:
      e = "RESERVED SUB TYPE";
      break;
    case ERR_FLAC_PREORDER_TOO_BIG:
      e = "PREORDER TOO BIG";
      break;
    case ERR_FLAC_RESERVED_RESIDUAL_CODING:
      e = "RESERVED RESIDUAL CODING";
      break;
    case ERR_FLAC_WRONG_RICE_PARTITION_NR:
      e = "WRONG RICE PARTITION NR";
      break;
    case ERR_FLAC_BITS_PER_SAMPLE_TOO_BIG:
      e = "BITS PER SAMPLE > 16";
      break;
    case ERR_FLAG_BITS_PER_SAMPLE_UNKNOWN:
      e = "BITS PER SAMPLE UNKNOWN";
      break;
    default:
      e = "ERR_UNKNOWN";
    }
    AUDIO_INFO("FLAC decode error %d : %s", r, e);
  }
}
//---------------------------------------------------------------------------------------------------------------------
bool Audio::setPinout(uint8_t BCLK, uint8_t LRC, uint8_t DOUT, int8_t DIN,
                      int8_t MCK) {

  m_pin_config.bck_io_num = BCLK;
  m_pin_config.ws_io_num = LRC; //  wclk
  m_pin_config.data_out_num = DOUT;
  m_pin_config.data_in_num = DIN;
#if (ESP_IDF_VERSION_MAJOR >= 4 && ESP_IDF_VERSION_MINOR >= 4)
  m_pin_config.mck_io_num = MCK;
#endif

  const esp_err_t result = i2s_set_pin((i2s_port_t)m_i2s_num, &m_pin_config);
  return (result == ESP_OK);
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t Audio::getFileSize() {
  if (!audiofile)
    return 0;
  return audiofile.size();
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t Audio::getFilePos() {
  if (!audiofile)
    return 0;
  return audiofile.position();
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t Audio::getAudioDataStartPos() {
  if (!audiofile)
    return 0;
  return m_audioDataStart;
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t Audio::getAudioFileDuration() {
  if (getDatamode() == AUDIO_LOCALFILE) {
    if (!audiofile)
      return 0;
  }
#ifndef AUDIO_NO_NETWORK
  if (m_streamType == ST_WEBFILE) {
    if (!m_contentlength)
      return 0;
  }
#endif

