vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  /*
      This will cause a clicking sound when adjusting the EQ.
      Because when the EQ is adjusted, the IIR filter will be cleared and
     played, mixed in the audio data frame, and a click-like sound will be
     produced.
  */
  /*
  int16_t tmp[2]; tmp[0] = 0; tmp[1]= 0;

  IIR_filterChain0(tmp, true ); // flush the filter
  IIR_filterChain1(tmp, true ); // flush the filter
  IIR_filterChain2(tmp, true ); // flush the filter
  */
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::forceMono(bool m) { // #100 mono option
  m_f_forceMono = m;            // false stereo, true mono
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::setBalance(int8_t bal) { // bal -16...16
  if (bal < -16)
    bal = -16;
  if (bal > 16)
    bal = 16;
  m_balance = bal;
}
//---------------------------------------------------------------------------------------------------------------------
void Audio::setVolume(uint8_t vol) { // vol 22 steps, 0...21
  if (vol > 21)
    vol = 21;
  m_vol = volumetable[vol];
}
//---------------------------------------------------------------------------------------------------------------------
uint8_t Audio::getVolume() {
  for (uint8_t i = 0; i < 22; i++) {
    if (volumetable[i] == m_vol)
      return i;
  }
  m_vol = 12; // if m_vol not found in table
  return m_vol;
}
//---------------------------------------------------------------------------------------------------------------------
uint8_t Audio::getI2sPort() { return m_i2s_num; }
//---------------------------------------------------------------------------------------------------------------------
int32_t Audio::Gain(int16_t s[2]) {
  int32_t v[2];
  float step = (float)m_vol / 64;
  uint8_t l = 0, r = 0;

  if (m_balance < 0) {
    step = step * (float)(abs(m_balance) * 4);
    l = (uint8_t)(step);
  }
  if (m_balance > 0) {
    step = step * m_balance * 4;
    r = (uint8_t)(step);
  }

  v[LEFTCHANNEL] = (s[LEFTCHANNEL] * (m_vol - l)) >> 6;
  v[RIGHTCHANNEL] = (s[RIGHTCHANNEL] * (m_vol - r)) >> 6;

  return (v[LEFTCHANNEL] << 16) | (v[RIGHTCHANNEL] & 0xffff);
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t Audio::inBufferFilled() {
  // current audio input buffer fillsize in bytes
  return InBuff.bufferFilled();
}
//---------------------------------------------------------------------------------------------------------------------
uint32_t Audio::inBufferFree() {
  // current audio input buffer free space in bytes
  return InBuff.freeSpace();
}
//---------------------------------------------------------------------------------------------------------------------
//            ***     D i g i t a l   b i q u a d r a t i c     f i l t e r ***
//---------------------------------------------------------------------------------------------------------------------
void Audio::IIR_calculateCoefficients(
    int8_t G0, int8_t G1,
    int8_t G2) { // Infinite Impulse Response (IIR) filters

  // G1 - gain low shelf   set between -40 ... +6 dB
  // G2 - gain peakEQ      set between -40 ... +6 dB
  // G3 - gain high shelf  set between -40 ... +6 dB
  // https://www.earlevel.com/main/2012/11/26/biquad-c-source-code/

  if (getSampleRate() < 1000)
    return; // fuse

  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // -

  if (G0 < -40)
    G0 = -40; // -40dB -> Vin*0.01
  if (G0 > 6)
    G0 = 6; // +6dB -> Vin*2
  if (G1 < -40)
    G1 = -40;
  if (G1 > 6)
    G1 = 6;
  if (G2 < -40)
    G2 = -40;
  if (G2 > 6)
    G2 = 6;

  const float FcLS = 500;    // Frequency LowShelf[Hz]
  const float FcPKEQ = 3000; // Frequency PeakEQ[Hz]
  const float FcHS = 6000;   // Frequency HighShelf[Hz]

  float K, norm, Q, Fc, V;

  // LOWSHELF
  Fc = (float)FcLS / (float)getSampleRate(); // Cutoff frequency
  K = tanf((float)PI * Fc);
  V = powf(10, fabs(G0) / 20.0);

  if (G0 >= 0) { // boost
    norm = 1 / (1 + sqrtf(2) * K + K * K);
    m_filter[LOWSHELF].a0 = (1 + sqrtf(2 * V) * K + V * K * K) * norm;
    m_filter[LOWSHELF].a1 = 2 * (V * K * K - 1) * norm;
    m_filter[LOWSHELF].a2 = (1 - sqrtf(2 * V) * K + V * K * K) * norm;
    m_filter[LOWSHELF].b1 = 2 * (K * K - 1) * norm;
    m_filter[LOWSHELF].b2 = (1 - sqrtf(2) * K + K * K) * norm;
  } else { // cut
    norm = 1 / (1 + sqrtf(2 * V) * K + V * K * K);
    m_filter[LOWSHELF].a0 = (1 + sqrtf(2) * K + K * K) * norm;
    m_filter[LOWSHELF].a1 = 2 * (K * K - 1) * norm;
    m_filter[LOWSHELF].a2 = (1 - sqrtf(2) * K + K * K) * norm;
    m_filter[LOWSHELF].b1 = 2 * (V * K * K - 1) * norm;
    m_filter[LOWSHELF].b2 = (1 - sqrtf(2 * V) * K + V * K * K) * norm;
  }

  // PEAK EQ
  Fc = (float)FcPKEQ / (float)getSampleRate(); // Cutoff frequency
  K = tanf((float)PI * Fc);
  V = powf(10, fabs(G1) / 20.0);
  Q = 2.5;       // Quality factor
  if (G1 >= 0) { // boost
    norm = 1 / (1 + 1 / Q * K + K * K);
    m_filter[PEAKEQ].a0 = (1 + V / Q * K + K * K) * norm;
    m_filter[PEAKEQ].a1 = 2 * (K * K - 1) * norm;
    m_filter[PEAKEQ].a2 = (1 - V / Q * K + K * K) * norm;
    m_filter[PEAKEQ].b1 = m_filter[PEAKEQ].a1;
    m_filter[PEAKEQ].b2 = (1 - 1 / Q * K + K * K) * norm;
  } else { // cut
    norm = 1 / (1 + V / Q * K + K * K);
    m_filter[PEAKEQ].a0 = (1 + 1 / Q * K + K * K) * norm;
    m_filter[PEAKEQ].a1 = 2 * (K * K - 1) * norm;
    m_filter[PEAKEQ].a2 = (1 - 1 / Q * K + K * K) * norm;
    m_filter[PEAKEQ].b1 = m_filter[PEAKEQ].a1;
    m_filter[PEAKEQ].b2 = (1 - V / Q * K + K * K) * norm;
  }

  // HIGHSHELF
  Fc = (float)FcHS / (float)getSampleRate(); // Cutoff frequency
  K = tanf((float)PI * Fc);
  V = powf(10, fabs(G2) / 20.0);
  if (G2 >= 0) { // boost
    norm = 1 / (1 + sqrtf(2) * K + K * K);
    m_filter[HIFGSHELF].a0 = (V + sqrtf(2 * V) * K + K * K) * norm;
    m_filter[HIFGSHELF].a1 = 2 * (K * K - V) * norm;
    m_filter[HIFGSHELF].a2 = (V - sqrtf(2 * V) * K + K * K) * norm;
    m_filter[HIFGSHELF].b1 = 2 * (K * K - 1) * norm;
    m_filter[HIFGSHELF].b2 = (1 - sqrtf(2) * K + K * K) * norm;
  } else {
    norm = 1 / (V + sqrtf(2 * V) * K + K * K);
    m_filter[HIFGSHELF].a0 = (1 + sqrtf(2) * K + K * K) * norm;
    m_filter[HIFGSHELF].a1 = 2 * (K * K - 1) * norm;
    m_filter[HIFGSHELF].a2 = (1 - sqrtf(2) * K + K * K) * norm;
    m_filter[HIFGSHELF].b1 = 2 * (K * K - V) * norm;
    m_filter[HIFGSHELF].b2 = (V - sqrtf(2 * V) * K + K * K) * norm;
  }

