vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  outSample[RIGHTCHANNEL] =
      m_filter[2].a0 * inSample[RIGHTCHANNEL] +
      m_filter[2].a1 * m_filterBuff[2][z1][in][RIGHTCHANNEL] +
      m_filter[2].a2 * m_filterBuff[2][z2][in][RIGHTCHANNEL] -
      m_filter[2].b1 * m_filterBuff[2][z1][out][RIGHTCHANNEL] -
      m_filter[2].b2 * m_filterBuff[2][z2][out][RIGHTCHANNEL];

  m_filterBuff[2][z2][in][RIGHTCHANNEL] = m_filterBuff[2][z1][in][RIGHTCHANNEL];
  m_filterBuff[2][z1][in][RIGHTCHANNEL] = inSample[RIGHTCHANNEL];
  m_filterBuff[2][z2][out][RIGHTCHANNEL] =
      m_filterBuff[2][z1][out][RIGHTCHANNEL];
  m_filterBuff[2][z1][out][RIGHTCHANNEL] = outSample[RIGHTCHANNEL];
  iir_out[RIGHTCHANNEL] = (int16_t)outSample[RIGHTCHANNEL];

  return iir_out;
}
//----------------------------------------------------------------------------------------------------------------------
//    AAC - T R A N S P O R T S T R E A M
//----------------------------------------------------------------------------------------------------------------------
bool Audio::ts_parsePacket(uint8_t *packet, uint8_t *packetStart,
                           uint8_t *packetLength) {

  const uint8_t TS_PACKET_SIZE = 188;
  const uint8_t PAYLOAD_SIZE = 184;
  const uint8_t PID_ARRAY_LEN = 4;

  (void)PAYLOAD_SIZE; // suppress [-Wunused-variable]

  typedef struct {
    int number = 0;
    int pids[PID_ARRAY_LEN];
  } pid_array;

  static pid_array pidsOfPMT;
  static int PES_DataLength = 0;
  static int pidOfAAC = 0;

  if (packet == NULL) {
    if (m_f_Log)
      log_i("parseTS reset");
    for (int i = 0; i < PID_ARRAY_LEN; i++)
      pidsOfPMT.pids[i] = 0;
    PES_DataLength = 0;
    pidOfAAC = 0;
    return true;
  }

  // --------------------------------------------------------------------------------------------------------
  // 0. Byte SyncByte  | 0 | 1 | 0 | 0 | 0 | 1 | 1 | 1 | always bit pattern of
  // 0x47
  //---------------------------------------------------------------------------------------------------------
  // 1. Byte           |PUSI|TP|   |PID|PID|PID|PID|PID|
  //---------------------------------------------------------------------------------------------------------
  // 2. Byte           |PID|PID|PID|PID|PID|PID|PID|PID|
  //---------------------------------------------------------------------------------------------------------
  // 3. Byte           |TSC|TSC|AFC|AFC|CC |CC |CC |CC |
  //---------------------------------------------------------------------------------------------------------
  // 4.-187. Byte      |Payload data if AFC==01 or 11  |
  //---------------------------------------------------------------------------------------------------------

  // PUSI Payload unit start indicator, set when this packet contains the first
  // byte of a new payload unit.
  //      The first byte of the payload will indicate where this new payload
  //      unit starts.
  // TP   Transport priority, set when the current packet has a higher priority
  // than other packets with the same PID. PID  Packet Identifier, describing
  // the payload data. TSC  Transport scrambling control, '00' = Not scrambled.
  // AFC  Adaptation field control, 01 – no adaptation field, payload only, 10 –
  // adaptation field only, no payload,
  //                                11 – adaptation field followed by payload,
  //                                00 – RESERVED for future use
  // CC   Continuity counter, Sequence number of payload packets (0x00 to 0x0F)
  // within each stream (except PID 8191)

  if (packet[0] != 0x47) {
    log_e("ts SyncByte not found, first bytes are %X %X %X %X", packet[0],
          packet[1], packet[2], packet[3]);
    stopSong();
    return false;
  }
  int PID = (packet[1] & 0x1F) << 8 | (packet[2] & 0xFF);
  if (m_f_Log)
    log_i("PID: 0x%04X(%d)", PID, PID);
  int PUSI = (packet[1] & 0x40) >> 6;
  if (m_f_Log)
    log_i("Payload Unit Start Indicator: %d", PUSI);
  int AFC = (packet[3] & 0x30) >> 4;
  if (m_f_Log)
    log_i("Adaption Field Control: %d", AFC);

  int AFL = -1;
  if ((AFC & 0b10) == 0b10) { // AFC '11' Adaptation Field followed
    AFL = packet[4] & 0xFF;   // Adaptation Field Length
    if (m_f_Log)
      log_i("Adaptation Field Length: %d", AFL);
  }
  int PLS = PUSI ? 5 : 4; // PayLoadStart, Payload Unit Start Indicator

  if (PID == 0) {
    // Program Association Table (PAT) - - - - - - - - - - - - - - - - - - - - -
    // - - - - - - - - - - - - - - - - - -
    if (m_f_Log)
      log_i("PAT");
    pidsOfPMT.number = 0;
    pidOfAAC = 0;
    int startOfProgramNums = 8;
    int lengthOfPATValue = 4;
    int sectionLength =
        ((packet[PLS + 1] & 0x0F) << 8) | (packet[PLS + 2] & 0xFF);
    if (m_f_Log)
      log_i("Section Length: %d", sectionLength);
    int program_number, program_map_PID;
    int indexOfPids = 0;
    (void)program_number; // [-Wunused-but-set-variable]
    for (int i = startOfProgramNums; i <= sectionLength;
         i += lengthOfPATValue) {
      program_number =
          ((packet[PLS + i] & 0xFF) << 8) | (packet[PLS + i + 1] & 0xFF);
      program_map_PID =
          ((packet[PLS + i + 2] & 0x1F) << 8) | (packet[PLS + i + 3] & 0xFF);
      if (m_f_Log)
        log_i("Program Num: 0x%04X(%d) PMT PID: 0x%04X(%d)", program_number,
              program_number, program_map_PID, program_map_PID);
      pidsOfPMT.pids[indexOfPids++] = program_map_PID;
    }
    pidsOfPMT.number = indexOfPids;
    *packetStart = 0;
    *packetLength = 0;
    return true;

  } else if (PID == pidOfAAC) {
    static uint8_t fillData = 0;
    if (m_f_Log)
      log_i("AAC");
    uint8_t posOfPacketStart = 4;
    if (AFL >= 0) {
      posOfPacketStart = 5 + AFL;
      if (m_f_Log)
        log_i("posOfPacketStart: %d", posOfPacketStart);
    }
    // Packetized Elementary Stream (PES) - - - - - - - - - - - - - - - - - - -
    // - - - - - - - - - - - - - -
    if (m_f_Log)
      log_i("PES_DataLength %i", PES_DataLength);
    if (PES_DataLength > 0) {
      *packetStart = posOfPacketStart + fillData;
      *packetLength = TS_PACKET_SIZE - posOfPacketStart - fillData;
      fillData = 0;
      PES_DataLength -= (*packetLength);
      return true;
    } else {
      int firstByte = packet[posOfPacketStart] & 0xFF;
      int secondByte = packet[posOfPacketStart + 1] & 0xFF;
      int thirdByte = packet[posOfPacketStart + 2] & 0xFF;
      if (m_f_Log)
        log_i("First 3 bytes: %02X %02X %02X", firstByte, secondByte,
              thirdByte);
      if (firstByte == 0x00 && secondByte == 0x00 &&
          thirdByte == 0x01) { // Packet start code prefix
        // PES
        uint8_t StreamID = packet[posOfPacketStart + 3] & 0xFF;
        if (StreamID >= 0xC0 && StreamID <= 0xDF) {
          ;
        } // okay ist audio stream
        if (StreamID >= 0xE0 && StreamID <= 0xEF) {
          log_e("video stream!");
          return false;
        }
        uint8_t PES_HeaderDataLength = packet[posOfPacketStart + 8] & 0xFF;
        if (m_f_Log)
          log_i("PES_headerDataLength %d", PES_HeaderDataLength);
        int PES_PacketLength = ((packet[posOfPacketStart + 4] & 0xFF) << 8) +
                               (packet[posOfPacketStart + 5] & 0xFF);
        if (m_f_Log)
          log_i("PES Packet length: %d", PES_PacketLength);
        PES_DataLength = PES_PacketLength;
        int startOfData = PES_HeaderDataLength + 9;
        if (posOfPacketStart + startOfData >= 188) { // only fillers in packet
          if (m_f_Log)
            log_e("posOfPacketStart + startOfData %i",
                  posOfPacketStart + startOfData);
          *packetStart = 0;
          *packetLength = 0;
          PES_DataLength -= (PES_HeaderDataLength + 3);
          fillData = (posOfPacketStart + startOfData) - 188;
          if (m_f_Log)
            log_i("fillData %i", fillData);
          return true;
        }
        if (m_f_Log)
          log_i("First AAC data byte: %02X",
                packet[posOfPacketStart + startOfData]);
        if (m_f_Log)
          log_i("Second AAC data byte: %02X",
                packet[posOfPacketStart + startOfData + 1]);
        *packetStart = posOfPacketStart + startOfData;
        *packetLength = TS_PACKET_SIZE - posOfPacketStart - startOfData;
        PES_DataLength -= (*packetLength);
        PES_DataLength -= (PES_HeaderDataLength + 3);
        return true;
      }
    }
    *packetStart = 0;
    *packetLength = 0;
    log_e("PES not found");
    return false;
  } else if (pidsOfPMT.number) {
    //  Program Map Table (PMT) - - - - - - - - - - - - - - - - - - - - - - - -
    //  - - - - - - - - - - - - - - - - - -
    for (int i = 0; i < pidsOfPMT.number; i++) {
      if (PID == pidsOfPMT.pids[i]) {
        if (m_f_Log)
          log_i("PMT");
        int staticLengthOfPMT = 12;
        int sectionLength =
            ((packet[PLS + 1] & 0x0F) << 8) | (packet[PLS + 2] & 0xFF);
        if (m_f_Log)
          log_i("Section Length: %d", sectionLength);
        int programInfoLength =
            ((packet[PLS + 10] & 0x0F) << 8) | (packet[PLS + 11] & 0xFF);
        if (m_f_Log)
          log_i("Program Info Length: %d", programInfoLength);
        int cursor = staticLengthOfPMT + programInfoLength;
        while (cursor < sectionLength - 1) {
          int streamType = packet[PLS + cursor] & 0xFF;
          int elementaryPID = ((packet[PLS + cursor + 1] & 0x1F) << 8) |
                              (packet[PLS + cursor + 2] & 0xFF);
          if (m_f_Log)
            log_i("Stream Type: 0x%02X Elementary PID: 0x%04X", streamType,
                  elementaryPID);

          if (streamType == 0x0F || streamType == 0x11) {
            if (m_f_Log)
              log_i("AAC PID discover");
            pidOfAAC = elementaryPID;
          }
          int esInfoLength = ((packet[PLS + cursor + 3] & 0x0F) << 8) |
                             (packet[PLS + cursor + 4] & 0xFF);
          if (m_f_Log)
            log_i("ES Info Length: 0x%04X", esInfoLength);
          cursor += 5 + esInfoLength;
        }
      }
    }
    *packetStart = 0;
    *packetLength = 0;
    return true;
  }
  // PES received before PAT and PMT seen
  *packetStart = 0;
  *packetLength = 0;
  return false;
}
//----------------------------------------------------------------------------------------------------------------------
//    W E B S T R E A M  -  H E L P   F U N C T I O N S
//----------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
uint16_t Audio::readMetadata(uint16_t maxBytes, bool first) {

  static uint16_t pos_ml = 0; // determines the current position in metaline
  static uint16_t metalen = 0;
  uint16_t res = 0;
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (first) {
    pos_ml = 0;
    metalen = 0;
    return 0;
  }
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -
  // - - - - - - - - - - - - - - - - - - -
  if (!maxBytes)
    return 0; // guard

  if (!metalen) {
    int b = _client->read(); // First byte of metadata?
    metalen = b * 16; // New count for metadata including length byte, max 4096
    pos_ml = 0;
    m_chbuf[pos_ml] = 0; // Prepare for new line
    res = 1;
  }
  if (!metalen) {
    m_metacount = m_metaint;
    return res;
  } // metalen is 0
  if (metalen < m_chbufSize) {
    uint16_t a =
        _client->readBytes(&m_chbuf[pos_ml], min((uint16_t)(metalen - pos_ml),
                                                 (uint16_t)(maxBytes - 1)));
    res += a;
    pos_ml += a;
  } else { // metadata doesn't fit in m_chbuf
    uint8_t c = 0;
    int8_t i = 0;
    while (pos_ml != metalen) {
      i = _client->read(&c, 1); // fake read
      if (i != -1) {
        pos_ml++;
        res++;
      } else {
        return res;
      }
    }
    m_metacount = m_metaint;
    metalen = 0;
    pos_ml = 0;
    return res;
  }
  if (pos_ml == metalen) {
    m_chbuf[pos_ml] = '\0';
    if (strlen(m_chbuf)) { // Any info present?
      // metaline contains artist and song name.  For example:
      // "StreamTitle='Don McLean - American Pie';StreamUrl='';"
      // Sometimes it is just other info like:
      // "StreamTitle='60s 03 05 Magic60s';StreamUrl='';"
      // Isolate the StreamTitle, remove leading and trailing quotes if present.
      latinToUTF8(m_chbuf, m_chbufSize); // convert to UTF-8 if necessary
      int pos =
          indexOf(m_chbuf, "song_spot", 0); // remove some irrelevant infos
      if (pos > 3) { // e.g. song_spot="T" MediaBaseId="0" itunesTrackId="0"
        m_chbuf[pos] = 0;
      }
      showstreamtitle(m_chbuf); // Show artist and title if present in metadata
    }
    m_metacount = m_metaint;
    metalen = 0;
    pos_ml = 0;
  }
  return res;
}
#endif // AUDIO_NO_NETWORK
//----------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
size_t Audio::chunkedDataTransfer(uint8_t *bytes) {
  uint8_t byteCounter = 0;
  size_t chunksize = 0;
  int b = 0;
  uint32_t ctime = millis();
  uint32_t timeout = 2000; // ms
  while (true) {
    if (ctime + timeout < millis()) {
      log_e("timeout");
      stopSong();
      return 0;
    }
    b = _client->read();
    byteCounter++;
    if (b < 0)
      continue; // -1 no data available
    if (b == '\n')
      break;
    if (b < '0')
      continue;
    // We have received a hexadecimal character.  Decode it and add to the
    // result.
    b = toupper(b) - '0'; // Be sure we have uppercase
    if (b > 9)
      b = b - 7; // Translate A..F to 10..15
    chunksize = (chunksize << 4) + b;
  }
  if (m_f_Log)
    log_i("chunksize %d", chunksize);
  *bytes = byteCounter;
  return chunksize;
}
#endif // AUDIO_NO_NETWORK
//----------------------------------------------------------------------------------------------------------------------
bool Audio::readID3V1Tag() {
  // this is an V1.x id3tag after an audio block, ID3 v1 tags are ASCII
  // Version 1.x is a fixed size at the end of the file (128 bytes) after a
  // <TAG> keyword.
  if (m_codec != CODEC_MP3)
    return false;
  if (InBuff.bufferFilled() == 128 &&
      startsWith((const char *)InBuff.getReadPtr(),
                 "TAG")) { // maybe a V1.x TAG
    char title[31];
    memcpy(title, InBuff.getReadPtr() + 3 + 0, 30);
    title[30] = '\0';
    latinToUTF8(title, sizeof(title));
    char artist[31];
    memcpy(artist, InBuff.getReadPtr() + 3 + 30, 30);
    artist[30] = '\0';
    latinToUTF8(artist, sizeof(artist));
    char album[31];
    memcpy(album, InBuff.getReadPtr() + 3 + 60, 30);
    album[30] = '\0';
    latinToUTF8(album, sizeof(album));
    char year[5];
    memcpy(year, InBuff.getReadPtr() + 3 + 90, 4);
    year[4] = '\0';
    latinToUTF8(year, sizeof(year));
    char comment[31];
    memcpy(comment, InBuff.getReadPtr() + 3 + 94, 30);
    comment[30] = '\0';
    latinToUTF8(comment, sizeof(comment));
    uint8_t zeroByte = *(InBuff.getReadPtr() + 125);
    uint8_t track = *(InBuff.getReadPtr() + 126);
    uint8_t genre = *(InBuff.getReadPtr() + 127);
    if (zeroByte) {
      AUDIO_INFO("ID3 version: 1");
    } //[2]
    else {
      AUDIO_INFO("ID3 Version 1.1");
    }
    if (strlen(title)) {
      sprintf(m_chbuf, "Title: %s", title);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    }
    if (strlen(artist)) {
      sprintf(m_chbuf, "Artist: %s", artist);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    }
    if (strlen(album)) {
      sprintf(m_chbuf, "Album: %s", album);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    }
    if (strlen(year)) {
      sprintf(m_chbuf, "Year: %s", year);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    }
    if (strlen(comment)) {
      sprintf(m_chbuf, "Comment: %s", comment);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    }
    if (zeroByte == 0) {
      sprintf(m_chbuf, "Track Number: %d", track);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    }
    if (genre < 192) {
      sprintf(m_chbuf, "Genre: %d", genre);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    } //[1]
    return true;
  }
  if (InBuff.bufferFilled() == 227 &&
      startsWith((const char *)InBuff.getReadPtr(),
                 "TAG+")) { // ID3V1EnhancedTAG
    AUDIO_INFO("ID3 version: 1 - Enhanced TAG");
    char title[61];
    memcpy(title, InBuff.getReadPtr() + 4 + 0, 60);
    title[60] = '\0';
    latinToUTF8(title, sizeof(title));
    char artist[61];
    memcpy(artist, InBuff.getReadPtr() + 4 + 60, 60);
    artist[60] = '\0';
    latinToUTF8(artist, sizeof(artist));
    char album[61];
    memcpy(album, InBuff.getReadPtr() + 4 + 120, 60);
    album[60] = '\0';
    latinToUTF8(album, sizeof(album));
    // one byte "speed" 0=unset, 1=slow, 2= medium, 3=fast, 4=hardcore
    char genre[31];
    memcpy(genre, InBuff.getReadPtr() + 5 + 180, 30);
    genre[30] = '\0';
    latinToUTF8(genre, sizeof(genre));
    // six bytes "start-time", the start of the music as mmm:ss
    // six bytes "end-time",   the end of the music as mmm:ss
    if (strlen(title)) {
      sprintf(m_chbuf, "Title: %s", title);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    }
    if (strlen(artist)) {
      sprintf(m_chbuf, "Artist: %s", artist);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    }
    if (strlen(album)) {
      sprintf(m_chbuf, "Album: %s", album);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    }
    if (strlen(genre)) {
      sprintf(m_chbuf, "Genre: %s", genre);
      if (audio_id3data)
        audio_id3data(m_chbuf);
    }
    return true;
  }
  return false;
  // [1] https://en.wikipedia.org/wiki/List_of_ID3v1_Genres
  // [2] https://en.wikipedia.org/wiki/ID3#ID3v1_and_ID3v1.1[5]
}
//----------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
void Audio::slowStreamDetection(uint32_t inBuffFilled, uint32_t maxFrameSize) {
  static uint32_t tmr_1s = millis(); // timer 1 sec
  static bool f_tmr_1s = false;
  static uint8_t cnt_slow = 0;
  if (tmr_1s + 1000 < millis()) {
    f_tmr_1s = true;
    tmr_1s = millis();
  }
  if (m_codec == CODEC_WAV)
    maxFrameSize /= 4;
  if (m_codec == CODEC_FLAC)
    maxFrameSize /= 2;
  if (inBuffFilled < maxFrameSize) {
    cnt_slow++;
    if (f_tmr_1s) {
      if (cnt_slow > 50)
        AUDIO_INFO("slow stream, dropouts are possible");
      f_tmr_1s = false;
      cnt_slow = 0;
    }
  } else
    cnt_slow = 0;
}
#endif // AUDIO_NO_NETWORK
//----------------------------------------------------------------------------------------------------------------------
#ifndef AUDIO_NO_NETWORK
void Audio::lostStreamDetection(uint32_t bytesAvail) {
  static uint32_t loopCnt = 0;
  if (!bytesAvail) {
    loopCnt++;
    if (loopCnt > 200000) { // wait several seconds
      loopCnt = 0;
      AUDIO_INFO("Stream lost -> try new connection");
      connecttohost(m_lastHost);
      return;
    }
  } else
    loopCnt = 0;
}
#endif // AUDIO_NO_NETWORK
//----------------------------------------------------------------------------------------------------------------------
void Audio::seek_m4a_stsz() {
  // stsz says what size each sample is in bytes. This is important for the
  // decoder to be able to start at a chunk, and then go through each sample by
  // its size. The stsz atom can be behind the audio block. Therefore, searching
  // for the stsz atom is only applicable to local files.

  /* atom hierarchy
  (example)_________________________________________________________________________________________

  ftyp -> moov -> trak -> tkhd
          free    udta    mdia -> mdhd
          mdat            udta    hdlr
          mvhd                    minf -> smhd
                                          dinf
                                          stbl -> stsd
                                                  stts
                                                  stsc
                                                  stsz -> determine and return
  the position and number of entries stco
  __________________________________________________________________________________________________________________*/

  struct m4a_Atom {
    int pos;
    int size;
    char name[5];
  } atom, at, tmp;

  // c99 has no inner functions, lambdas are only allowed from c11, please don't
  // use ancient compiler
  auto atomItems = [&](uint32_t startPos) { // lambda, inner function
    char tmp[5];
    audiofile.seek(startPos);
    audiofile.readBytes(tmp, 4);
    atom.size = bigEndian((uint8_t *)tmp, 4);
    audiofile.readBytes(atom.name, 4);
    atom.name[4] = '\0';
    atom.pos = startPos;
    return atom;
  };
  // - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -

  boolean found = false;
  uint32_t seekpos = 0;
  uint32_t filesize = getFileSize();
  char name[6][5] = {"moov", "trak", "mdia", "minf", "stbl", "stsz"};
  char noe[4];

  if (!audiofile)
    return; // guard

  at.pos = 0;
  at.size = filesize;
  seekpos = 0;

  for (int i = 0; i < 6; i++) {
    found = false;
    while (seekpos < at.pos + at.size) {
      tmp = atomItems(seekpos);
      seekpos += tmp.size;
      if (strcmp(tmp.name, name[i]) == 0) {
        memcpy((void *)&at, (void *)&tmp, sizeof(tmp));
        found = true;
      }
      if (m_f_Log)
        log_i("name %s pos %d, size %d", tmp.name, tmp.pos, tmp.size);
    }
    if (!found)
      goto noSuccess;
    seekpos = at.pos + 8; // 4 bytes size + 4 bytes name
  }

  seekpos += 8; // 1 byte version + 3 bytes flags + 4  bytes sample size
  audiofile.seek(seekpos);
  audiofile.readBytes(noe, 4); // number of entries
  m_stsz_numEntries = bigEndian((uint8_t *)noe, 4);
  if (m_f_Log)
    log_i("number of entries in stsz: %d", m_stsz_numEntries);
  m_stsz_position = seekpos + 4;
  audiofile.seek(0);
  return;

noSuccess:
  m_stsz_numEntries = 0;
  m_stsz_position = 0;
  log_e("m4a atom stsz not found");
  audiofile.seek(0);
  return;
}
//----------------------------------------------------------------------------------------------------------------------
uint32_t Audio::m4a_correctResumeFilePos(uint32_t resumeFilePos) {
  // In order to jump within an m4a file, the exact beginning of an aac block
  // must be found. Since m4a cannot be streamed, i.e. there is no syncword, an
  // imprecise jump can lead to a crash.

