vicliu624/LoFiBox/lib/ESP32-audioI2S/Audio.cpp
  if (!m_stsz_position)
    return m_audioDataStart; // guard

  typedef union {
    uint8_t u8[4];
    uint32_t u32;
  } tu;
  tu uu;

  uint32_t i = 0, pos = m_audioDataStart;
  audiofile.seek(m_stsz_position);

  while (i < m_stsz_numEntries) {
    i++;
    uu.u8[3] = audiofile.read();
    uu.u8[2] = audiofile.read();
    uu.u8[1] = audiofile.read();
    uu.u8[0] = audiofile.read();
    pos += uu.u32;
    if (pos >= resumeFilePos)
      break;
  }
  return pos;
}
//----------------------------------------------------------------------------------------------------------------------
uint32_t Audio::flac_correctResumeFilePos(uint32_t resumeFilePos) {
  // The starting point is the next FLAC syncword
  uint8_t p1, p2;
  boolean found = false;
  uint32_t pos = resumeFilePos;
  audiofile.seek(pos);

  p1 = audiofile.read();
  p2 = audiofile.read();
  pos += 2;
  while (!found || pos == m_file_size) {
    if (p1 == 0xFF && p2 == 0xF8) {
      found = true;
      log_i("found");
      break;
    }
    p1 = p2;
    p2 = audiofile.read();
    pos++;
  }

  if (found)
    return (pos - 2);
  return m_audioDataStart;
}
//----------------------------------------------------------------------------------------------------------------------
uint32_t Audio::mp3_correctResumeFilePos(uint32_t resumeFilePos) {
  // The starting point is the next MP3 syncword
  uint8_t p1, p2;
  boolean found = false;
  uint32_t pos = resumeFilePos;
  audiofile.seek(pos);

  p1 = audiofile.read();
  p2 = audiofile.read();
  pos += 2;
  while (!found || pos == m_file_size) {
    if (p1 == 0xFF && (p2 & 0xF0) == 0xF0) {
      found = true;
      break;
    }
    p1 = p2;
    p2 = audiofile.read();
    pos++;
  }

  if (found)
    return (pos - 2);
  return m_audioDataStart;
}
//----------------------------------------------------------------------------------------------------------------------
